var video;
var listenView;
var nextPlayFlag = true;
//讲义美观评分
var beautifulScore = 5;
//讲师讲课吸引度评分
var attractScore = 5;
//课程和力度评分
var reasonableScore = 5;
/**
 * @description		听课页面js逻辑
 * @author 			zwr
 * @date:				2016-6-15
 * @modify:
 * @version 			1.0
 */
define(function(require, exports, module) {
    require('./swfobject');
    var tool = require('./tool');
    video = require('./video.js');
    function bindFirst(){
        $("#first").html("");
        $("#first").append("<option value='http://v.dongaocloud.com/2b4f/2ba9'>初级会计实务</option>");
        $("#first").append("<option value='http://v.dongaocloud.com/2b4f/2ba8'>经济法基础</option>");
       /* $.getJSON('http://esp-resource-service.beta.101.com/v1.0/groupkey', function (json) {
            var lst = eval(json);
            $("#first").html("");
            for (i = 0; i < lst.length; i++) {
                var tname = lst[i].name;
                var tid = lst[i].id;
                $("#first").append("<option value='" + tid + "'>" + tname + "</option>");
            }
        });*/
    };
    function bindSecond(id){
        var json='[{"id":"12577","name":"2_生活中的法律常识.docx"},{"id":"17414","name":"2018年初级会计资格考试•初级名师面对面—《学习方法指导》.doc"},{"id":"17762","name":"2_第一单元  法律基础（1）.doc"},{"id":"17763","name":"3_第一单元  法律基础（2）.docx"},{"id":"17764","name":"3_第二单元  经济仲裁.docx"},{"id":"17768","name":"4_法的本质和特征.doc"},{"id":"17769","name":"1_前言.docx"},{"id":"17774","name":"5_第二单元  民事诉讼（1）.doc"},{"id":"17776","name":"2_法的本质与特征、法的形式与分类.doc"},{"id":"17778","name":"4_法律责任.doc"},{"id":"17779","name":"6_民事诉讼的适用范围、审判制度、诉讼管辖（地域管辖）、诉讼时效（1）.docx"},{"id":"17780","name":"5_经济纠纷的解决途径，仲裁的适用范围、基本原则、机构、协议、裁决.doc"},{"id":"17782","name":"3_法律关系、法律事实.docx"},{"id":"17788","name":"7_诉讼时效（2）、判决与执行.doc"},{"id":"17789","name":"6_第三单元 民事诉讼（2）、第四单元 行政复议.docx"},{"id":"17791","name":"8_第一单元  会计机构与会计人员、第二单元  会计核算.doc"},{"id":"17795","name":"9_第二单元  会计核算（2）、第三单元  会计监督.docx"},{"id":"17799","name":"7_第五单元  行政诉讼.doc"},{"id":"17800","name":"1_2018初级《经济法基础》考情分析.doc"},{"id":"17801","name":"10_第四单元  会计职业道德、第五单元  法律责任.doc"},{"id":"17802","name":"11_第一单元  银行结算账户（1）.doc"},{"id":"17803","name":"3_2018“新初级”的复习方略.docx"},{"id":"17804","name":"1_“新初级”的过去与2018基本考情.doc"},{"id":"17805","name":"2_2018“新初级”考试大纲与命题思路.docx"},{"id":"17813","name":"6_法的形式、法的分类、法律责任.docx"},{"id":"17814","name":"5_法律关系、民事权利能力与民事行为能力、自然人的刑事责任能力.doc"},{"id":"17815","name":"12_第一单元  银行结算账户（2）、第二单元  非票据结算方式（1）.docx"},{"id":"17823","name":"1_前言.doc"},{"id":"17824","name":"13_第二单元  非票据结算方式（2）.doc"},{"id":"17825","name":"15_第三单元　支票、银行汇票和银行本票(2).doc"},{"id":"17826","name":"14_第二单元  非票据结算方式（3）、第三单元  支票、银行汇票和银行本票（1）.docx"},{"id":"17827","name":"9_诉讼时效.doc"},{"id":"17828","name":"7_民事争议纠纷解决途径的选择、仲裁.docx"},{"id":"17829","name":"10_行政争议纠纷解决途径的选择、行政复议的受案范围与管辖.docx"},{"id":"17830","name":"8_民事诉讼程序、民事诉讼的管辖.docx"},{"id":"17843","name":"1_开学第一课.docx"},{"id":"17844","name":"1_前言.doc"},{"id":"17847","name":"16_商业汇票（1）.doc"},{"id":"17850","name":"15_什么是会计职业道德、会计职业道德的主要内容.docx"},{"id":"17852","name":"8_行政复议范围、行政复议申请与复议机关、行政复议决定.docx"},{"id":"17853","name":"11_行政复议程序、行政诉讼.docx"},{"id":"17854","name":"1_“新初级”的过去与2018基本考情.doc"},{"id":"17855","name":"2_2018“新初级”考试大纲与命题思路.docx"},{"id":"17856","name":"3_2018“新初级”的复习方略.docx"},{"id":"17857","name":"4_第一单元考情分析.doc"},{"id":"17858","name":"12_会计法律制度概述、会计核算概述.doc"},{"id":"17859","name":"16_银行结算账户的概念、种类、开立、变更和撤销、具体银行结算账户的开立和使用（1）.doc"},{"id":"17862","name":"5_法的本质和特征.doc"},{"id":"17863","name":"18_银行卡概述、信用卡.doc"},{"id":"17864","name":"17_第四单元  商业汇票（2）.docx"},{"id":"17865","name":"20_第一单元  税收法律制度概述、第二单元  增值税法律制度（1）.docx"},{"id":"17873","name":"13_会计核算的具体规则、会计档案管理.doc"},{"id":"17874","name":"14_会计监督、会计机构与会计人员、违反会计法律制度的法律责任.docx"},{"id":"17880","name":"17_各类具体银行结算账户的开立和使用（2）、银行结算账户的管理.doc"},{"id":"17884","name":"19_网上支付、银行卡收单业务.doc"},{"id":"17885","name":"21_第二单元  增值税法律制度（2）.doc"},{"id":"17900","name":"22_第二单元  增值税法律制度（3）.docx"},{"id":"17901","name":"23_第二单元  增值税法律制度（4）、第三单元  营改增（1）.docx"},{"id":"17902","name":"20_汇兑、托收承付、委托收款.doc"},{"id":"17904","name":"19_第四单元  商业汇票（4）.doc"},{"id":"17905","name":"18_第四单元  商业汇票（3）.doc"},{"id":"17909","name":"9_行政诉讼范围、行政诉讼管辖与审理.doc"},{"id":"17910","name":"10_会计法律制度的适用范围、管理体制、会计核算的基本要求、内容、其他要求.doc"},{"id":"17911","name":"21_国内信用证.docx"},{"id":"17912","name":"22_预付卡、支付结算概述、办理支付结算的基本要求.doc"},{"id":"17913","name":"25_第三单元  营改增（3）、第四单元  消费税法律制度（1）.docx"},{"id":"17915","name":"24_营改增（2）.doc"},{"id":"17921","name":"26_第四单元 消费税法律制度（2）.doc"},{"id":"17923","name":"23_银行汇票.docx"},{"id":"17927","name":"24_商业汇票概述.docx"},{"id":"17928","name":"6_法律关系（总述）（1）.doc"},{"id":"17929","name":"7_法律关系（总述）（2）.doc"},{"id":"17930","name":"8_民事权利能力与民事行为能力.doc"},{"id":"17931","name":"9_自然人的刑事责任能力.docx"},{"id":"17932","name":"11_会计凭证、会计账簿、财务会计报告、账务核对及财产清查.doc"},{"id":"17933","name":"12_会计档案的范围归档、移交、保管与销毁、特殊情况下的处置.doc"},{"id":"17935","name":"25_银行承兑汇票、商业承兑汇票、商业汇票的贴现、银行本票、支票.docx"},{"id":"17951","name":"15_会计专业职务与会计专业技术资格、总会计师、会计法律与会计职业道德的联系与区别.docx"},{"id":"17953","name":"26_票据的基础知识、票据行为—出票、背书、承兑.doc"},{"id":"17954","name":"27_第四单元 消费税法律制度（3）.doc"},{"id":"17955","name":"28_第五单元 关税、进口增值税和进口消费税.doc"},{"id":"17956","name":"14_会计机构、代理记账、会计岗位与会计人员、会计工作交接.doc"},{"id":"17957","name":"13_单位内部会计监督、会计工作的政府监督、会计工作的社会监督.doc"},{"id":"17958","name":"16_会计职业道德的主要内容、违反会计法律制度的法律责任.docx"},{"id":"17998","name":"10_法的形式.docx"},{"id":"17999","name":"11_法的分类.docx"},{"id":"18000","name":"12_法律责任.docx"},{"id":"18001","name":"13_第二单元考情分析.docx"},{"id":"18002","name":"14_民事争议纠纷解决途径的选择.docx"},{"id":"18003","name":"15_仲裁.docx"},{"id":"18004","name":"17_支付结算的概念及工具、办理支付结算的原则、基本要求.doc"},{"id":"18005","name":"31_第一单元 企业所得税法律制度（3）.doc"},{"id":"18006","name":"32_第一单元 企业所得税法律制度（4）、第二单元 个人所得税法律制度（1）.doc"},{"id":"18007","name":"27_票据保证；票据权利的取得、行使和保全；票据权利_付款请求权、追索权、丧失补救、时效.docx"},{"id":"18008","name":"29_第一单元 企业所得税法律制度（1）.doc"},{"id":"18009","name":"30_第一单元 企业所得税法律制度（2）.doc"},{"id":"18010","name":"16_民事诉讼程序.docx"},{"id":"18011","name":"17_民事诉讼的管辖.docx"},{"id":"18012","name":"18_诉讼时效（1）.docx"},{"id":"18013","name":"19_诉讼时效（2）.docx"},{"id":"18014","name":"20_第三单元考情分析.docx"},{"id":"18015","name":"21_行政争议纠纷解决途径的选择.docx"},{"id":"18016","name":"22_行政复议的受案范围.docx"},{"id":"18017","name":"23_行政复议的管辖.docx"},{"id":"18018","name":"24_行政复议程序.docx"},{"id":"18019","name":"25_行政诉讼.docx"},{"id":"18020","name":"26_第一章小结.docx"},{"id":"18021","name":"28_税收与税收法律关系、税法要素、征税范围的基本规定.doc"},{"id":"18022","name":"33_第二单元 个人所得税法律制度（2）.docx"},{"id":"18026","name":"29_视同发生应税行为、混合销售和兼营、征税范围的其他规定.doc"},{"id":"18027","name":"35_第二单元  个人所得税法律制度（4）.doc"},{"id":"18028","name":"30_增值税应纳税额的计算方法、增值税纳税义务发生时间.doc"},{"id":"18036","name":"34_第二单元个人所得税法律制度（3）.doc"},{"id":"18037","name":"36_第二单元个人所得税法律制度（5）.doc"},{"id":"18043","name":"31_销售额确定的一般规则.docx"},{"id":"18044","name":"32_核定销售额、特殊销售方式下货物销售额的确定.docx"},{"id":"18045","name":"34_购进固定资产的进项税额、购进农产品进项税额的抵扣、进项税额的“扣减、转增与留抵”（吴楠）（12月16日）（50：49）.docx"},{"id":"18046","name":"33_有关行业销售额的特殊规定、增值税的税率、进项税额确定的一般规定.doc"},{"id":"18047","name":"35_应纳税额的计算、采用简易办法计税的情形、进口货物应纳增值税的计算.doc"},{"id":"18048","name":"36_增值税的税收优惠、增值税的征收管理规定.docx"},{"id":"18052","name":"37_应税消费品（消费税税目）、消费税的征税环节.docx"},{"id":"18054","name":"38_消费税的税率、消费税计税销售额和销售数量的确定.docx"},{"id":"18055","name":"39_组成计税价格计算消费税应纳税额的情形、已纳消费税的扣除、消费税的征收管理规定.docx"},{"id":"18056","name":"18_银行结算账户的概念与种类、开立、变更与撤销、基本、一般、专用存款账户.doc"},{"id":"18057","name":"30_会计核算的具体规则（1）.doc"},{"id":"18058","name":"31_会计核算的具体规则（2）.doc"},{"id":"18059","name":"32_会计档案管理.doc"},{"id":"18060","name":"38_第二章第二单元考情分析.docx"},{"id":"18061","name":"39_什么是会计职业道德.docx"},{"id":"18062","name":"40_会计职业道德的主要内容.docx"},{"id":"18063","name":"41_第二章小结.docx"},{"id":"18064","name":"27_第二章第一单元考情分析.doc"},{"id":"18065","name":"28_会计法律制度概述.doc"},{"id":"18066","name":"29_会计核算概述.doc"},{"id":"18069","name":"42_第三章第一单元考情分析.doc"},{"id":"18070","name":"43_银行结算账户的概念和种类.doc"},{"id":"18071","name":"44_银行结算账户的开立.doc"},{"id":"18072","name":"45_银行结算账户的变更和撤销.doc"},{"id":"18073","name":"46_各类具体银行结算账户的开立和使用（1）.doc"},{"id":"18074","name":"33_会计监督.docx"},{"id":"18075","name":"34_单位内部控制制度.docx"},{"id":"18076","name":"35_会计机构与会计人员（1）.docx"},{"id":"18077","name":"36_会计机构与会计人员（2）.docx"},{"id":"18078","name":"37_违反会计法律制度的法律责任.docx"},{"id":"18079","name":"47_各类具体银行结算账户的开立和使用（2）.doc"},{"id":"18080","name":"48_各类具体银行结算账户的开立和使用（3）.doc"},{"id":"18081","name":"49_银行结算账户的管理.doc"},{"id":"18083","name":"50_第三章第二单元考情分析.doc"},{"id":"18084","name":"51_银行卡概述.doc"},{"id":"18085","name":"52_信用卡.doc"},{"id":"18086","name":"53_网上支付.doc"},{"id":"18087","name":"54_银行卡收单业务（1）.doc"},{"id":"18088","name":"55_银行卡收单业务（2）.doc"},{"id":"18089","name":"75_票据的基础知识.doc"},{"id":"18090","name":"76_票据行为—出票.doc"},{"id":"18091","name":"77_票据行为—背书.doc"},{"id":"18092","name":"78_票据行为—承兑.doc"},{"id":"18093","name":"68_商业汇票概述（1）.docx"},{"id":"18094","name":"69_商业汇票概述（2）.docx"},{"id":"18095","name":"60_国内信用证（1）.docx"},{"id":"18096","name":"56_第三章第三单元考情分析.doc"},{"id":"18097","name":"61_国内信用证（2）.docx"},{"id":"18098","name":"57_汇兑.doc"},{"id":"18099","name":"58_托收承付.doc"},{"id":"18100","name":"59_委托收款.doc"},{"id":"18101","name":"62_预付卡.doc"},{"id":"18102","name":"63_支付结算概述.doc"},{"id":"18103","name":"65_第三章第四单元考情分析.docx"},{"id":"18104","name":"64_办理支付结算的基本要求.doc"},{"id":"18105","name":"66_银行汇票（1）.docx"},{"id":"18106","name":"67_银行汇票（2）.docx"},{"id":"18107","name":"79_票据行为——保证.docx"},{"id":"18108","name":"80_票据权利的取得、行使和保全.docx"},{"id":"18109","name":"81_票据权利——付款请求权.docx"},{"id":"18110","name":"82_票据权利——追索权.docx"},{"id":"18111","name":"83_票据权利丧失补救.docx"},{"id":"18112","name":"84_票据权利时效.docx"},{"id":"18113","name":"85_第三章小结.docx"},{"id":"18114","name":"70_银行承兑汇票.docx"},{"id":"18115","name":"71_商业承兑汇票.docx"},{"id":"18116","name":"72_商业汇票的贴现.docx"},{"id":"18117","name":"73_银行本票.docx"},{"id":"18118","name":"74_支票.docx"},{"id":"18119","name":"19_预算单位零余额账户、临时存款账户、个人银行结算账户、银行结算账户的管理.doc"},{"id":"18120","name":"37_第一单元  房产税、第二单元  契税.docx"},{"id":"18121","name":"38_第二单元  契税（2）、第三单元  城镇土地使用税、第四单元  耕地占用税.docx"},{"id":"18123","name":"39_第五单元土地增值税（1）.docx"},{"id":"18124","name":"40_第五单元土地增值税（2）、第六单元车辆购置税、第七单元车船税.docx"},{"id":"18125","name":"43_第一单元 税务管理、第二单元 税款征收与税务检查（1）.doc"},{"id":"18126","name":"40_企业所得税纳税人、企业所得税应纳税额计算的基本思路、收入总额.doc"},{"id":"18127","name":"41_收入总额、不征收收入和免税收入、企业所得税税前扣除项目.doc"},{"id":"18137","name":"45_第一单元　劳动合同的订立、第二单元　劳动合同的内容（1）.docx"},{"id":"18139","name":"42_企业所得税税前扣除项目（2）、资产的税务处理.docx"},{"id":"18140","name":"47_第二单元  劳动合同的内容（3）、第三单元  劳动合同的解除和终止（1）.docx"},{"id":"18141","name":"43_企业所得税的税收优惠政策.doc"},{"id":"18142","name":"44_案例、亏损弥补、境外所得抵免、非居民企业应纳税所得额、征收管理.doc"},{"id":"18143","name":"45_纳税人、工资、薪金所得——基本规定、常规收入的处理.doc"},{"id":"18144","name":"46_工资、薪金所得——偶发收入的处理、劳务报酬所得.doc"},{"id":"18146","name":"46_第二单元 劳动合同的内容（2）.doc"},{"id":"18147","name":"44_第二单元税款征收与税务检查（2）、第三单元税务行政复议、第四单元税收法律责任.docx"},{"id":"18149","name":"41_第八单元印花税、第九单元环境保护税、第十单元烟叶税.doc"},{"id":"18150","name":"42_第十一单元资源税.doc"},{"id":"18153","name":"48_第三单元  劳动合同的解除和终止（2）、第四单元  特殊的劳动合同.docx"},{"id":"18155","name":"47_稿酬所得、特许权使用费所得、利息、股息、红利所得.doc"},{"id":"18156","name":"49_第五单元  劳动争议的解决、第六单元  社会保险法律制度（1）.docx"},{"id":"18159","name":"49_按年计征征税项目的基本规定、“个体工商户的生产、经营所得”项目的各项扣除.docx"},{"id":"18162","name":"86_第四章第一单元考情分析.doc"},{"id":"18163","name":"87_税收与税收法律关系.doc"},{"id":"18164","name":"88_税法要素.doc"},{"id":"18165","name":"89_第四章第二单元考情分析.doc"},{"id":"18166","name":"90_征税范围的基本规定（1）.doc"},{"id":"18168","name":"91_征税范围的基本规定（2）.doc"},{"id":"18169","name":"92_视同发生应税行为.doc"},{"id":"18170","name":"93_混合销售和兼营.doc"},{"id":"18171","name":"94_征税范围的其他规定.doc"},{"id":"18172","name":"95_增值税应纳税额的计算方法.doc"},{"id":"18173","name":"96_增值税纳税义务发生时间.doc"},{"id":"18174","name":"48_财产转让所得、租赁所得、偶然所得与其他所得、公益性捐赠支出.doc"},{"id":"18180","name":"97_销售额确定的一般规则（1）.docx"},{"id":"18181","name":"98_销售额确定的一般规则（2）.docx"},{"id":"18182","name":"99_核定销售额.docx"},{"id":"18183","name":"100_特殊销售方式下货物销售额的确定（1）.docx"},{"id":"18184","name":"101_特殊销售方式下货物销售额的确定（2）.docx"},{"id":"18185","name":"102_有关行业销售额的特殊规定.doc"},{"id":"18186","name":"103_增值税的税率.doc"},{"id":"18187","name":"104_进项税额确定的一般规定（1）.doc"},{"id":"18188","name":"105_进项税额确定的一般规定（2）.doc"},{"id":"18189","name":"106_购进固定资产的进项税额.docx"},{"id":"18190","name":"107_购进农产品进项税额的抵扣（1）.docx"},{"id":"18191","name":"108_购进农产品进项税额的抵扣（2）.docx"},{"id":"18192","name":"109_进项税额的“扣减、转增与留抵”.docx"},{"id":"18193","name":"110_一般计税方法下应纳税额的计算.doc"},{"id":"18194","name":"111_一般纳税人采用简易办法计税的情形.doc"},{"id":"18195","name":"112_小规模纳税人应纳增值税的计算.doc"},{"id":"18196","name":"113_进口货物应纳增值税的计算.doc"},{"id":"18197","name":"114_增值税的税收优惠.docx"},{"id":"18198","name":"115_增值税的征收管理规定.docx"},{"id":"18199","name":"116_第四章第三单元考情分析.docx"},{"id":"18200","name":"117_应税消费品（消费税税目）.docx"},{"id":"18201","name":"118_消费税的征税环节（1）.docx"},{"id":"18202","name":"119_消费税的征税环节（2）.docx"},{"id":"18203","name":"120_消费税的税率.docx"},{"id":"18204","name":"121_确定消费税计税销售额和销售数量的基本规则.docx"},{"id":"18205","name":"122_特殊情形下消费税计税销售额和销售数量的确定.docx"},{"id":"18206","name":"123_组成计税价格计算消费税应纳税额的情形（1）.docx"},{"id":"18207","name":"124_组成计税价格计算消费税应纳税额的情形（2）.docx"},{"id":"18208","name":"125_已纳消费税的扣除.docx"},{"id":"18209","name":"126_消费税的征收管理规定.docx"},{"id":"18210","name":"127_第四章小结.docx"},{"id":"18211","name":"128_第五章第一单元考情分析.doc"},{"id":"18212","name":"129_企业所得税纳税人.doc"},{"id":"18213","name":"130_企业所得税应纳税额计算的基本思路.doc"},{"id":"18214","name":"131_收入总额（1）.doc"},{"id":"18215","name":"132_收入总额（2）.doc"},{"id":"18216","name":"133_不征税收入和免税收入.doc"},{"id":"18217","name":"134_企业所得税税前扣除项目（1）.doc"},{"id":"18218","name":"135_企业所得税税前扣除项目（2）①.doc"},{"id":"18219","name":"136_企业所得税税前扣除项目（2）②.doc"},{"id":"18220","name":"149_第五章第二单元考情分析.doc"},{"id":"18221","name":"150_纳税人.doc"},{"id":"18222","name":"151_工资、薪金所得——基本规定.doc"},{"id":"18223","name":"152_工资、薪金所得——常规收入的处理.doc"},{"id":"18224","name":"153_工资、薪金所得——偶发收入的处理（1）.doc"},{"id":"18225","name":"154_工资、薪金所得——偶发收入的处理（2）.doc"},{"id":"18226","name":"155_劳务报酬所得（1）.doc"},{"id":"18227","name":"156_劳务报酬所得（2）.doc"},{"id":"18228","name":"157_稿酬所得（1）.doc"},{"id":"18229","name":"158_稿酬所得（2）.doc"},{"id":"18230","name":"159_特许权使用费所得.doc"},{"id":"18231","name":"160_利息、股息、红利所得.doc"},{"id":"18232","name":"165_按年计征征税项目的基本规定.docx"},{"id":"18233","name":"166_“个体工商户的生产、经营所得”项目的各项扣除.docx"},{"id":"18234","name":"51_第六单元 社会保险法律制度（3）.docx"},{"id":"18235","name":"141_企业所得税的税收优惠政策（1）.doc"},{"id":"18236","name":"142_企业所得税的税收优惠政策（2）.doc"},{"id":"18237","name":"143_企业所得税应纳税额计算的典型案例（1）.doc"},{"id":"18238","name":"144_企业所得税应纳税额计算的典型案例（2）.doc"},{"id":"18239","name":"145_以前年度亏损的弥补.doc"},{"id":"18240","name":"146_企业取得境外所得计税时的抵免.doc"},{"id":"18241","name":"147_非居民企业的应纳税所得额.doc"},{"id":"18242","name":"148_企业所得税的征收管理规定.doc"},{"id":"18243","name":"161_财产转让所得.doc"},{"id":"18244","name":"162_财产租赁所得.doc"},{"id":"18245","name":"163_偶然所得与其他所得.doc"},{"id":"18246","name":"164_公益性捐赠支出的个人所得税处理.doc"},{"id":"18247","name":"137_企业所得税税前扣除项目（3）.docx"},{"id":"18248","name":"138_企业所得税税前扣除项目（4）.docx"},{"id":"18249","name":"139_资产的税务处理——固定资产.docx"},{"id":"18250","name":"140_资产的税务处理——其他资产.docx"},{"id":"18251","name":"50_第六单元  社会保险法律制度（2）.docx"},{"id":"18252","name":"1_第一单元  会计法律制度.docx"},{"id":"18281","name":"20_银行卡、网上支付、预付卡.doc"},{"id":"18282","name":"24_出票、背书.doc"},{"id":"18283","name":"50_各征税项目综述、个人所得税税收优惠政策、个人所得税的征收管理.docx"},{"id":"18284","name":"167_各征税项目综述.docx"},{"id":"18285","name":"168_个人所得税税收优惠政策.docx"},{"id":"18286","name":"169_个人所得税的征收管理.docx"},{"id":"18287","name":"170_第五章小结.docx"},{"id":"18288","name":"51_是否应当缴纳房产税、房产税应纳税额的计算.docx"},{"id":"18291","name":"52_房产税的税收优惠政策和征收管理规定、城镇土地使用税的基本规定及税收优惠政策.doc"},{"id":"18312","name":"171_第六章第一单元考情分析.docx"},{"id":"18313","name":"172_是否应当缴纳房产税.docx"},{"id":"18314","name":"173_房产税应纳税额的计算.docx"},{"id":"18315","name":"21_汇兑、托收承付、委托收款、国内信用证.docx"},{"id":"18316","name":"22_票据的分类与票据当事人、银行汇票、商业汇票.doc"},{"id":"18320","name":"174_房产税的税收优惠政策和征收管理规定.doc"},{"id":"18321","name":"175_城镇土地使用税的基本规定.doc"},{"id":"18322","name":"176_城镇土地使用税的税收优惠政策.doc"},{"id":"18323","name":"53_契税应纳税额的计算、税收优惠及征收管理、土地增值税的纳税人和征税范围.doc"},{"id":"18324","name":"54_土地增值税应纳税额的计算及管理规定、印花税的相关考点.doc"},{"id":"18325","name":"23_银行本票、支票.doc"},{"id":"18326","name":"55_是否应当缴纳车辆购置税、车辆购置税的应纳税额、车辆购置税的征收管理.docx"},{"id":"18327","name":"56_车船税应税和免税车船的判定、车船税的应纳税额、车船税的征收管理规定.docx"},{"id":"18328","name":"57_是否应当缴纳资源税、资源税应纳税额的计算、资源税的税收优惠政策和征收管理规定.doc"},{"id":"18329","name":"58_关税的纳税人、税率的种类、应纳税额的计算以及征收管理.doc"},{"id":"18330","name":"59_城市维护建设税与教育费附加、环境保护税、耕地占用税、烟叶税.doc"},{"id":"18334","name":"177_第六章第二单元考情分析.doc"},{"id":"18335","name":"178_契税的纳税人和征税范围.doc"},{"id":"18336","name":"179_契税应纳税额的计算.doc"},{"id":"18337","name":"180_契税的税收优惠政策与征收管理规定.doc"},{"id":"18338","name":"181_土地增值税的纳税人和征税范围.doc"},{"id":"18340","name":"182_土地增值税应纳税额的计算（1）.doc"},{"id":"18341","name":"183_土地增值税应纳税额的计算（2）.doc"},{"id":"18342","name":"184_土地增值税的征收管理规定.doc"},{"id":"18343","name":"185_印花税的纳税人.doc"},{"id":"18344","name":"186_印花税——经济合同.doc"},{"id":"18345","name":"187_印花税——其他税目.doc"},{"id":"18346","name":"188_印花税的税收优惠政策和征收管理规定.doc"},{"id":"18347","name":"189_第六章第三单元考情分析.docx"},{"id":"18348","name":"190_是否应当缴纳车辆购置税.docx"},{"id":"18349","name":"191_车辆购置税的应纳税额.docx"},{"id":"18350","name":"192_车辆购置税的征收管理.docx"},{"id":"18351","name":"193_车船税应税和免税车船的判定.docx"},{"id":"18352","name":"194_车船税的应纳税额.docx"},{"id":"18353","name":"195_车船税的征收管理规定.docx"},{"id":"18379","name":"196_第六章第四单元考情分析.doc"},{"id":"18382","name":"197_是否应当缴纳资源税（1）.doc"},{"id":"18398","name":"198_是否应当缴纳资源税（2）.doc"},{"id":"18403","name":"199_资源税应纳税额的计算（1）.doc"},{"id":"18405","name":"200_资源税应纳税额的计算（2）.doc"},{"id":"18406","name":"201_资源税的税收优惠政策和征收管理规定.doc"},{"id":"18409","name":"202_第六章第五单元考情分析.doc"},{"id":"18410","name":"203_关税的纳税人.doc"},{"id":"18411","name":"204_关税税率的种类.doc"},{"id":"18412","name":"205_关税的应纳税额的计算方法.doc"},{"id":"18413","name":"206_关税完税价格.doc"},{"id":"18414","name":"207_关税的税收优惠.doc"},{"id":"18415","name":"208_关税的征收管理.doc"},{"id":"18416","name":"209_第六章第六单元考情分析.doc"},{"id":"18417","name":"210_城市维护建设税与教育费附加.doc"},{"id":"18418","name":"211_环境保护税.doc"},{"id":"18419","name":"212_耕地占用税.doc"},{"id":"18420","name":"213_烟叶税.doc"},{"id":"18421","name":"214_第六章小结.doc"},{"id":"18422","name":"25_承兑、保证.docx"},{"id":"18808","name":"26_票据权利的概念、票据权利的取得、票据权利的补救.doc"},{"id":"18816","name":"28_税收法律制度概述.doc"},{"id":"18817","name":"29_增值税的征税范围（1）.doc"},{"id":"18818","name":"30_增值税的征税范围（2）.doc"},{"id":"18819","name":"31_税率与征收率、销项税额（1）.doc"},{"id":"18820","name":"32_销项税额（2）.docx"},{"id":"18821","name":"27_票据权利时效、票据责任、追索权.docx"},{"id":"18822","name":"38_已纳消费税的扣除、消费税征收管理.doc"},{"id":"18823","name":"34_增值税应纳税额的计算、增值税税收优惠（1）.docx"},{"id":"18824","name":"35_增值税税收优惠（2）、增值税其他问题.docx"},{"id":"18825","name":"60_税务登记、账簿和凭证及发票管理、纳税申报、涉税服务及税款征收.doc"},{"id":"18826","name":"61_应纳税额的核定调整、税款征收、税务检查及税收法律责任.doc"},{"id":"18830","name":"33_进项税额.docx"},{"id":"18831","name":"215_第七章考情分析.doc"},{"id":"18832","name":"216_税务登记管理.doc"},{"id":"18833","name":"217_账簿和凭证管理.doc"},{"id":"18834","name":"218_发票管理.doc"},{"id":"18835","name":"219_纳税申报.doc"},{"id":"18836","name":"220_涉税专业服务.doc"},{"id":"18837","name":"221_税款征收的方式.doc"},{"id":"18838","name":"222_应纳税额的核定与调整.doc"},{"id":"18839","name":"223_税款征收措施（1）.doc"},{"id":"18840","name":"224_税款征收措施（2）.doc"},{"id":"18841","name":"225_税务检查.doc"},{"id":"18842","name":"226_税收法律责任.doc"},{"id":"18843","name":"227_第七章小结.doc"},{"id":"18847","name":"36_消费税税目、消费税征税范围.doc"},{"id":"18848","name":"37_消费税计税依据、组成计税价格.doc"},{"id":"18856","name":"228_第八章第一单元考情分析.docx"},{"id":"18857","name":"229_劳动合同的订立主体：劳动者和用人单位.docx"},{"id":"18858","name":"230_劳动关系的建立与书面劳动合同的签订.docx"},{"id":"18859","name":"231_劳动合同的效力.docx"},{"id":"18860","name":"232_劳动合同主要内容总述.docx"},{"id":"18861","name":"62_劳动合同订立主体、劳动关系的建立、劳动合同的效力和主要内容.docx"},{"id":"18862","name":"63_无固定期限劳动合同、工时制度、带薪年休假、劳动报酬.docx"},{"id":"18863","name":"233_无固定期限劳动合同.docx"},{"id":"18864","name":"234_工时制度.docx"},{"id":"18865","name":"235_带薪年休假.docx"},{"id":"18866","name":"236_劳动报酬（1）.docx"},{"id":"18867","name":"237_劳动报酬（2）.docx"},{"id":"18877","name":"65_竞业限制、劳动合同的履行和变更、劳动合同的解除.docx"},{"id":"18881","name":"64_试用期、服务期.doc"},{"id":"18892","name":"68_社会保险法律制度概述、职工基本养老、医疗保险.docx"},{"id":"18893","name":"238_试用期.doc"},{"id":"18894","name":"239_服务期.doc"},{"id":"18895","name":"67_集体合同、劳务派遣、劳动争议的解决.doc"},{"id":"18897","name":"66_劳动合同的终止、经济补偿金、劳动合同解除和终止、非全日制用工.docx"},{"id":"18899","name":"240_竞业限制.docx"},{"id":"18900","name":"241_劳动合同的履行和变更.docx"},{"id":"18901","name":"242_劳动合同的解除.docx"},{"id":"18902","name":"243_劳动合同的终止.docx"},{"id":"18903","name":"244_经济补偿金.docx"},{"id":"18904","name":"245_劳动合同解除和终止的法律后果.docx"},{"id":"18905","name":"246_非全日制用工.docx"},{"id":"18907","name":"69_工伤保险、失业保险.doc"},{"id":"18914","name":"252_职工基本养老保险.docx"},{"id":"18915","name":"253_职工基本医疗保险（1）.docx"},{"id":"18916","name":"254_职工基本医疗保险（2）.docx"},{"id":"18917","name":"247_集体合同.doc"},{"id":"18918","name":"248_劳务派遣.doc"},{"id":"18919","name":"249_劳动争议的解决（1）.doc"},{"id":"18920","name":"250_劳动争议的解决（2）.doc"}]';
        if(id=="http://v.dongaocloud.com/2b4f/2ba9"){
            json='[{"id":"17419","name":"1_2018年《初级会计实务》--学习方法指导.doc"},{"id":"17767","name":"2_会计概述（1）.doc"},{"id":"17770","name":"3_会计概述（2）.doc"},{"id":"17773","name":"4_会计概述（3）.doc"},{"id":"17783","name":"1_前言.doc"},{"id":"17786","name":"7_会计概述（6）.doc"},{"id":"17787","name":"8_会计概述（7）.doc"},{"id":"17790","name":"1_开学第一课.doc"},{"id":"17792","name":"1_前言.doc"},{"id":"17796","name":"6_会计概述（5）.doc"},{"id":"17797","name":"5_会计概述（4）.doc"},{"id":"17798","name":"1_教材变化分析指导.doc"},{"id":"17806","name":"9_会计概述（8）.doc"},{"id":"17807","name":"10_会计概述（9）.doc"},{"id":"17808","name":"11_会计概述（10）.docx"},{"id":"17809","name":"2_第一章小结.doc"},{"id":"17810","name":"3_第一章_会计概念、职能和目标.doc"},{"id":"17811","name":"4_第一章_会计基本假设.doc"},{"id":"17812","name":"5_第一章_会计基础.doc"},{"id":"17816","name":"2_会计概念、职能和目标.doc"},{"id":"17817","name":"3_会计基本假设、会计基础和会计信息质量要求（1）.doc"},{"id":"17818","name":"9_第一章_会计要素及其确认与计量（3）.doc"},{"id":"17819","name":"10_第一章_会计等式.docx"},{"id":"17820","name":"11_第一章_会计科目和账户（1）.docx"},{"id":"17821","name":"12_第一章_会计科目和账户（2）.docx"},{"id":"17822","name":"12_货币资金.docx"},{"id":"17845","name":"4_会计基本假设、会计基础和会计信息质量要求（2）.doc"},{"id":"17846","name":"5_会计基本假设、会计基础和会计信息质量要求（3）.doc"},{"id":"17851","name":"19_存货（4）.doc"},{"id":"17860","name":"18_存货（3）.docx"},{"id":"17866","name":"6_会计要素及其确认与计量（1）.doc"},{"id":"17867","name":"7_会计要素及其确认与计量（2）.doc"},{"id":"17868","name":"8_会计要素及其确认与计量（3）.docx"},{"id":"17869","name":"20_固定资产（1）.docx"},{"id":"17870","name":"13_第一章_借贷记账法（1）.docx"},{"id":"17871","name":"14_第一章_借贷记账法（2）.docx"},{"id":"17872","name":"15_第一章_借贷记账法（3）.docx"},{"id":"17875","name":"6_第一章_会计信息的质量要求.docx"},{"id":"17876","name":"7_第一章_会计要素及其确认与计量（1）.docx"},{"id":"17877","name":"8_第一章_会计要素及其确认与计量（2）.docx"},{"id":"17881","name":"13_应收及预付款项（1）.doc"},{"id":"17882","name":"14_应收及预付款项（2）.doc"},{"id":"17883","name":"15_交易性金融资产.doc"},{"id":"17886","name":"17_存货（2）.doc"},{"id":"17903","name":"16_存货（1）.docx"},{"id":"17907","name":"23_无形资产和长期待摊费用.doc"},{"id":"17908","name":"22_固定资产（3）.docx"},{"id":"17916","name":"开学典礼.docx"},{"id":"17922","name":"9_会计科目和借贷记账法（1）.docx"},{"id":"17925","name":"开学典礼.docx"},{"id":"17926","name":"12_会计科目和借贷记账法（4）.doc"},{"id":"17936","name":"16_第一章_会计凭证（1）.docx"},{"id":"17937","name":"17_第一章_会计凭证（2）.docx"},{"id":"17938","name":"18_第一章_会计凭证（3）.docx"},{"id":"17939","name":"19_第一章_会计账簿（1）.doc"},{"id":"17940","name":"25_第二章 小结.doc"},{"id":"17941","name":"20_第一章_会计账簿（2）.doc"},{"id":"17942","name":"26_第二章 资产的概念.doc"},{"id":"17943","name":"21_第一章_会计账簿（3）.doc"},{"id":"17944","name":"27_第二章 货币资金（1）.doc"},{"id":"17945","name":"28_第二章 货币资金（2）.doc"},{"id":"17952","name":"10_会计科目和借贷记账法（2）.doc"},{"id":"17960","name":"29_第二章_应收票据.doc"},{"id":"17962","name":"30_第二章_应收账款.doc"},{"id":"17963","name":"31_第二章_预付账款.doc"},{"id":"17964","name":"32_第二章_其他应收款以及应收股利和应收利息.doc"},{"id":"17965","name":"33_第二章_应收款项减值（1）.doc"},{"id":"17966","name":"34_第二章_应收款项减值（2）.doc"},{"id":"17967","name":"35_第二章_交易性金融资产（1）.doc"},{"id":"17968","name":"36_第二章_交易性金融资产（2）.doc"},{"id":"17969","name":"37_第二章_交易性金融资产（3）.doc"},{"id":"17970","name":"38_第二章_交易性金融资产（4）.doc"},{"id":"17971","name":"11_会计科目和借贷记账法（3）.doc"},{"id":"17972","name":"39_第二章_存货概述（1）.docx"},{"id":"17973","name":"40_第二章_存货概述（2）.docx"},{"id":"17974","name":"41_第二章_原材料（1）.docx"},{"id":"17975","name":"42_第二章_原材料（2）.docx"},{"id":"17976","name":"43_第二章_其他存货的核算（1）.docx"},{"id":"17977","name":"44_第二章_其他存货的核算（2）.docx"},{"id":"17978","name":"21_固定资产（2）.doc"},{"id":"17980","name":"（22）lz_cjzn_kj_0107_1(韩燕）.doc"},{"id":"17981","name":"23_第一章_财产清查.doc"},{"id":"17982","name":"24_第一章_财产报告.doc"},{"id":"17984","name":"45_第二章_其他存货的核算（3）.docx"},{"id":"17985","name":"46_第二章_存货清查.docx"},{"id":"17986","name":"47_第二章_存货减值.docx"},{"id":"17992","name":"48_第二章_固定资产（1）.docx"},{"id":"17993","name":"49_第二章_固定资产（2）.docx"},{"id":"17994","name":"50_第二章_固定资产（3）.docx"},{"id":"17995","name":"58_第二章_无形资产（1）.doc"},{"id":"17996","name":"59_第二章_无形资产（2）.doc"},{"id":"17997","name":"60_第二章_长期待摊费用.doc"},{"id":"18023","name":"51_第二章_固定资产（4）.docx"},{"id":"18024","name":"52_第二章_固定资产（5）.docx"},{"id":"18025","name":"53_第二章_固定资产（6）.docx"},{"id":"18029","name":"54_第二章_固定资产（7）.doc"},{"id":"18030","name":"55_第二章_固定资产（8）.doc"},{"id":"18031","name":"56_第二章_固定资产（9）.doc"},{"id":"18032","name":"57_第二章_固定资产（10）.doc"},{"id":"18038","name":"13_会计凭证、会计账簿与账务处理程序（1）.doc"},{"id":"18039","name":"14_会计凭证、会计账簿与账务处理程序（2）.doc"},{"id":"18040","name":"15_会计凭证、会计账簿与账务处理程序（3）.doc"},{"id":"18042","name":"1_前言.doc"},{"id":"18050","name":"16_会计凭证、会计账簿与账务处理程序（4）.doc"},{"id":"18051","name":"19_财产清查.doc"},{"id":"18067","name":"17_会计凭证、会计账簿与账务处理程序（5）.doc"},{"id":"18068","name":"18_会计凭证、会计账簿与账务处理程序（6）.doc"},{"id":"18145","name":"24_短期借款、应付及预收款项.doc"},{"id":"18148","name":"25_应付职工薪酬.docx"},{"id":"18152","name":"26_应交税费（1）.docx"},{"id":"18158","name":"28_应交税费（3）.doc"},{"id":"18177","name":"31_留存收益.doc"},{"id":"18178","name":"29_实收资本（1）.doc"},{"id":"18179","name":"30_实收资本（2）、资本公积.doc"},{"id":"18254","name":"64_第三章  小结.doc"},{"id":"18255","name":"65_第三章  负债概述.doc"},{"id":"18256","name":"66_第三章　短期借款.doc"},{"id":"18257","name":"67_第三章　应付账款.doc"},{"id":"18258","name":"68_第三章  应付票据.doc"},{"id":"18259","name":"69_第三章  预收账款.doc"},{"id":"18260","name":"70_第三章  应付利息和应付股利.doc"},{"id":"18261","name":"71_第三章  其他应付款.doc"},{"id":"18262","name":"61_第二章_习题（1）.doc"},{"id":"18263","name":"62_第二章_习题（2）.doc"},{"id":"18264","name":"63_第二章_习题（3）.doc"},{"id":"18275","name":"72_第三章_应付职工薪酬（1）.docx"},{"id":"18276","name":"73_第三章_应付职工薪酬（2）.docx"},{"id":"18277","name":"74_第三章_应付职工薪酬（3）.docx"},{"id":"18278","name":"75_第三章_应付职工薪酬（4）.docx"},{"id":"18279","name":"32_收入（1）.doc"},{"id":"18280","name":"21_货币资金（1）.doc"},{"id":"18289","name":"35_费用.doc"},{"id":"18290","name":"20_财务报告.docx"},{"id":"18306","name":"76_第三章_应交税费概述.docx"},{"id":"18307","name":"77_第三章_应交增值税（1）.docx"},{"id":"18308","name":"78_第三章_应交增值税（2）.docx"},{"id":"18309","name":"79_第三章_应交增值税（3）.doc"},{"id":"18310","name":"80_第三章_应交增值税（4）.doc"},{"id":"18311","name":"81_第三章_应交增值税（5）.doc"},{"id":"18317","name":"22_货币资金（2）.docx"},{"id":"18318","name":"33_收入（2）.docx"},{"id":"18319","name":"34_收入（3）.docx"},{"id":"18331","name":"86_第三章_习题（1）.docx"},{"id":"18332","name":"87_第三章_习题（2）.docx"},{"id":"18333","name":"88_第四章_小结.docx"},{"id":"18339","name":"89_第四章_所有者权益概述.docx"},{"id":"18407","name":"23_应收及预付款项（1）.docx"},{"id":"18408","name":"24_应收及预付款项（2）.docx"},{"id":"18423","name":"36_利润（1）.doc"},{"id":"18424","name":"37_利润（2）.doc"},{"id":"18444","name":"90_实收资本（1）.doc"},{"id":"18445","name":"91_实收资本（2）.doc"},{"id":"18446","name":"92_资本公积.doc"},{"id":"18496","name":"25_应收及预付款项（3）.docx"},{"id":"18498","name":"26_应收及预付款项（4）.docx"},{"id":"18690","name":"82_第三章_应交增值税（6）.docx"},{"id":"18691","name":"83_第三章_应交增值税（7）.docx"},{"id":"18692","name":"84_第三章_应交消费税.docx"},{"id":"18693","name":"85_第三章_其他应交税费.docx"},{"id":"18810","name":"103_第五章_提供劳务收入（1）.docx"},{"id":"18811","name":"104_第五章_提供劳务收入（2）.docx"},{"id":"18812","name":"105_第五章_让渡资产使用权收入.docx"},{"id":"18813","name":"106_第五章_费用的概念和特点.docx"},{"id":"18814","name":"107_第五章_营业成本.docx"},{"id":"18815","name":"108_第五章_税金及附加.docx"},{"id":"18827","name":"93_第四章_留存收益（1）.doc"},{"id":"18828","name":"94_第四章_留存收益（2）.doc"},{"id":"18829","name":"95_第四章_习题.doc"},{"id":"18849","name":"109_第五章_期间费用（1）.docx"},{"id":"18850","name":"110_第五章_期间费用（2）.docx"},{"id":"18851","name":"111_第五章_利润的构成.docx"},{"id":"18852","name":"112_第五章_营业外收支.docx"},{"id":"18868","name":"96_第五章 小结.docx"},{"id":"18869","name":"97_第五章_收入概述.docx"},{"id":"18870","name":"98_第五章_销售商品收入（1）.docx"},{"id":"18871","name":"99_第五章_销售商品收入（2）.docx"},{"id":"18872","name":"100_第五章_销售商品收入（3）.docx"},{"id":"18873","name":"101_第五章_销售商品收入（4）.docx"},{"id":"18874","name":"102_第五章_销售商品收入（5）.docx"},{"id":"18883","name":"116_第五章  习题（1）.doc"},{"id":"18884","name":"117_第五章  习题（2）.doc"},{"id":"18885","name":"29_存货（1）.doc"},{"id":"18886","name":"32_存货（4）.doc"},{"id":"18887","name":"113_第五章_所得税费用（1）.doc"},{"id":"18888","name":"114_第五章_所得税费用（2）.doc"},{"id":"18889","name":"115_第五章_本年利润.doc"},{"id":"18890","name":"第五章 习题（3）.docx"},{"id":"18891","name":"第五章 习题（4）.docx"},{"id":"18896","name":"31_存货（3）.doc"},{"id":"18906","name":"33_存货（5）.doc"},{"id":"18908","name":"30存货（2）.docx"},{"id":"18909","name":"120_第六章 _本章小结.doc"},{"id":"18910","name":"121_第六章 _资产负债表概述.doc"},{"id":"18911","name":"122_第六章_资产负债表的结构.doc"},{"id":"18912","name":"34_固定资产（1）.docx"},{"id":"18924","name":"40 短期借款，应付及预收款项.docx"},{"id":"18925","name":"35_固定资产（2）.doc"},{"id":"18926","name":"36_固定资产（3）.doc"},{"id":"18927","name":"41_应付及预付款项（2）.docx"},{"id":"18935","name":"43 应交税费（1）.docx"},{"id":"18937","name":"42_应付职工薪酬.docx"},{"id":"18938","name":"37_固定资产（4）.doc"},{"id":"18939","name":"38_固定资产（5），无形资产和长期待摊费用（1）.doc"},{"id":"18940","name":"39_无形资产和长期待摊费用（2）.doc"},{"id":"18941","name":"44 应交税费（2）.docx"}]';
        }
        var lst = eval(json);
        $("#second").html("");
        for (i = 0; i < lst.length; i++) {
            var tname = lst[i].name;
            var tid = lst[i].id;
            $("#second").append("<option value='" + tid + "'>" + tname + "</option>");
        }
      /*
        $.getJSON('http://esp-resource-service.beta.101.com/v1.0/groupitem?id='+id, function (json) {
            var lst = eval(json);
            $("#second").html("");
            for (i = 0; i < lst.length; i++) {
                var tname = lst[i].name;
                var tid = lst[i].id;
                $("#second").append("<option value='" + tid + "'>" + tname + "</option>");
            }
        });*/
    };
    function init(){
       var  initType = "three";
        //请求服务获取播放参数
        listenView.init({
            pageType:initType,
            url:"http://esp-resource-service.beta.101.com/v1.0/exp/lecture_content?id="+$("#requestURL").val(),
            flash:'DongAoPlayer'
        });
    }
    //听课页面对象
    listenView = {
        //页面参数配置
        conf:{
            //初始化flash请求路径
            url:'',
            //初始化flashname
            flash:'',
            //初始化大小屏类型
            initPageType:'',
            //大小屏幕配置
            screen:{
                moveflog : true,//true为可拖拽区域滚动条移动不新设置属性；false为恢复视频原位置；
                videoType : ''
            }
        },
        //页面数据
        data:{
            curHandout:{},//当前播放的讲义
            flag: 0, //点击知识点 双击讲义的时候，标识，存储时间；
            isHead: true,//是片头
            curWindow:''
        },
        //初始化方法
        init:function(param){
            if(param && param.pageType && param.flash && param.url){
                listenView.conf.initPageType = param.pageType;
                listenView.conf.flash = param.flash;
                listenView.conf.url = param.url;
                listenView.data.curWindow = param.pageType;
                this.onFun();
                //提问，设置回答发邮件通知
                $('.email_icon').on('click',function(){
                    $(this).toggleClass('email_icon_act')
                });
                alert("init")
                $.each(this.inits,function(i,n){
                    n();
                });
                /*没有flash 插件的元素
                 * 在没有flash 插件的时候，复写这四个方法，防止页面保存
                 * */
                if($('.fla-no').is(':visible')){
                    video.playVideo = function(){};
                    video.pauseVideo = function(){};
                    video.getVideoStatus = function(){};
                    video.skipTitleAndSeek = function(){};
                }
            }
        },
        inits:{
            //初始化数据
            initDate:function(){
                //三分屏讲义最大高度
                listenView.data.threeHandoutMaxHeight = Math.max($(window).height() - 181,480);
                //初始化弹窗
                $('.lister_pop_box').css({'margin-top':($(window).height()-480)/2});
            },
            //初始化页面
            initPage:function(){
                listenView.handler.drawPage(listenView.conf.initPageType);
            },
            //初始化播放器
            initPlay:function(){
                //初始化
                video.init({
                    url:listenView.conf.url,
                    flash:listenView.conf.flash
                });
                //视频播放完毕
                video.forFlash.flashFinishPlayVideo = function(param){
                    var play = $('.playing');
                    play.removeClass('playing select_listen');
                    $(" p:first",play).removeClass('little_p').children('.lecture_title').remove();
                }
                //flash时时调用每100毫秒
                video.forFlash.mediaRefresh = function(param){
                    if (listenView.data.flag != 0 && (listenView.data.flag - param[1]) > 0
                        && (listenView.data.flag - param[1]) < 10) {
                        //有flag 标识 并且小于 10 s
                    } else {
                        listenView.data.flag = 0;
                        listenView.handler.initHandout(param);
                    }
                }
                //flash知识点实际时间
                video.forFlash.setRealTime = function (param) {
                    listenView.data.flag = param[1];
                    listenView.handler.initHandout(param);
                }
                //flash大小改变
                video.forFlash.falshSizeChange = function(param){
                    if(param[1] === video.menu.bigVideo){
                        listenView.data.curWindow = 'big';
                        listenView.handler.drawPage('big');
                    }else if(param[1] === video.menu.threeVideo){
                        listenView.data.curWindow = 'three';
                        listenView.handler.drawPage('three');
                    }
                }
                //flash初始化完毕
                video.forFlash.playerIsReady = function(param){
                    if(listenView.conf.screen.videoType === video.menu.bigVideo){
                        //显示播放列表
                        $('#video_list').show();
                    }
                    //初始化视频大小类型
                    video.changeVideoType(listenView.conf.screen.videoType);
                }

            }
        },
        //页面处理事件工具类
        handler: {
            //改变页面布局
            drawPage: function (type) {
                listenView.data.small = false;
                if (type.indexOf('big') > -1) {
                    if(listenView.isbig === true){
                        return false;
                    }
                    listenView.isbig = true;
                    //设置小窗为可滚动
                    listenView.conf.screen.moveflog = true;
                    //设置视频大小
                    $('#videoContainer').css({width: 1180, height: 525});
                    //改变播放类型为大视频
                    try {
                        video.changeVideoType(video.menu.bigVideo);
                        //显示播放列表
                        $('#video_list').show();
                    } catch (e) {
                        listenView.conf.screen.videoType = video.menu.bigVideo;
                    }
                    if(type === 'big'){
                        $('html,body').scrollTop(1);
                    }
                } else {
                    //隐藏播放列表
                    $('#video_list').hide();
                    listenView.isbig = false;
                }
                //大屏
                if (type == 'big') {
                    //需要缓存视频播放格式为大视频
                    putCacheInitPlayType("big");
                    $('#threeScreen').hide();
                    $('#bigHandoutTitle').show();
                    $('#threeHandoutTitle').hide();
                    $('.B_fixed').removeClass('B_fixed_three');
                    //讲义设置
                    /*$('.Nlist_left').css({
                     width: '65%'
                     });*/
                    $('#lecture').attr('style', '').css('overflow-y', 'hidden');
                    /*$('.right_big').show();*/
                    $('.three_left_down').hide();

                    $('.warp').removeClass('warp-thr');//三分屏 全屏
                    if(!!listenView.conf.ulFlag){
                        //如果大视频的  答疑 试题 笔记
                        $('.Nlist_left').css({
                            width: $('.Nlist_left').parent().width() - 20 + 'px'
                        });
                    }else{
                        $('.right_big').show();
                        $('.Nlist_left').css({
                            width: '65%'
                        });
                    }
                    listenView.data.threeScreeLock = false;
                }
                //三分屏
                else if (type == 'three') {
                    //缓存视频播放格式为三分屏
                    putCacheInitPlayType("three");
                    listenView.data.threeScreeLock = true;
                    var lecture = $('#lecture');
                    lecture.css('overflow-y', 'auto');
                    $('.warp').addClass('warp-thr');//三分屏 全屏
                    listenView.conf.screen.moveflog = false;
                    //设置视频大小
                    $('#videoContainer').css({width: 455, height: 280});
                    //设置flash大小类型
                    try {
                        video.changeVideoType(video.menu.threeVideo);
                    } catch (e) {
                        listenView.conf.screen.videoType = video.menu.threeVideo;
                    }
                    $('#bigHandoutTitle').hide();
                    $('#threeHandoutTitle').show();
                    $('.B_fixed').addClass('B_fixed_three');
                    $('#threeScreen').show();
                    //讲义设置
                    $('.Nlist_left').css({
                        width: function () {
                            return $('#bigScreen').width() - 515;
                        }
                    });
                    $('#lecture').css('height', listenView.data.threeHandoutMaxHeight);
                    $('.right_big').hide();
                    $('.three_left_down').show();
                    //初始化左侧选项卡高度
                    $('#three_left_tab_panl .text').each(function () {
                        var height = $(window).height() - $('#three_left_tab_panl .text:first').offset().top - 20;
                        height = Math.max(height, 183);
                        if ($(this).height() > height) {
                            $(this).css({height: height, 'overflow-y': 'auto'})
                        }
                    });
                    //设置视频悬浮右侧边
                    $('#box').css({width: 'auto', position: "static"});
                    //显示视频title
                    $('.audio_title').hide();
                    if($('.playing:first').length > 0){
                        lecture.animate({scrollTop:$('.playing:first').offset().top+lecture.scrollTop()-lecture.offset().top}, 100);
                    }
                } else if (type == 'smalltobig') {
                    //设置视频悬浮右侧边
                    $('#box').css({width: 'auto', position: "static"});
                    //显示视频title
                    $('.audio_title').hide();
                } else if (type == 'small') {
                    listenView.data.small = true;
                    //设置flash大小类型
                    try {
                        video.changeVideoType(video.menu.smallVideo);
                        listenView.conf.screen.videoType = video.menu.smallVideo;
                    } catch (e) {
                        listenView.conf.screen.videoType = video.menu.smallVideo;
                    }
                    //设置视频大小
                    $('#videoContainer').css({width: 400, height: 225});
                    //设置视频悬浮右侧边
                    $('#box').css({
                        width: 400,
                        position: "fixed",
                        bottom: 40,
                        right: 10,
                        left: "inherit",
                        top: "inherit"
                    });
                    //显示视频title
                    $('.audio_title').show();
                    //弹框
                    listenView.handler.dragBox($('#box'));
                }
                //关闭
                else if (type == 'smallclose') {
                    listenView.handler.drawPage('smalltobig');
                    $(document).scrollTop(0);
                }
            },
            //初始化讲义位置
            initHandout: function (param) {
                var lects = $('#lecture .section');
                lects.each(function(i,n){
                    if(Math.round(parseTime2Second($(n).attr('time'))) >param[1]){
                        listenView.handler.setCurHandout($(n).prev());
                        return false;
                    }else if(i === lects.length-1){
                        listenView.handler.setCurHandout($(n));
                    }
                });
                var $cataBig = $('#video_list'), //大屏目录
                    $cataThr = $('.listen_course_list'), //三分屏目录
                    $activi = $cataBig.find('[time]'); //大屏选知识点
                if($activi.length == 0){//大屏目录q
                    $activi = $cataThr.find('[time]');
                }
                $activi.each(function(i,n){
                    if(Math.round(parseTime2Second($(n).attr('time'))) >param[1]){
                        if(!$($activi[i-1]).hasClass('activity')){
                            $cataBig.find('.activity').removeClass('activity cur_play');//清空选中的
                            $cataBig.find('.cur_play').removeClass('cur_play activity');//清空选中的
                            $cataThr.find('.cur_play').removeClass('cur_play activity');//清空选中的
                            $($activi[i-1]).addClass('activity cur_play'); //大屏
                            $cataThr.find('[time="'+$($activi[i-1]).attr('time')+'"]:last').addClass('cur_play cur_play');//三分屏 根据时间选中
                        }
                        return false;
                    }else if(i === $activi.length-1){
                        if(!$($activi[i]).hasClass('activity')){
                            $cataBig.find('.activity').removeClass('activity cur_play');//清空选中的
                            $cataBig.find('.cur_play').removeClass('cur_play activity');//清空选中的
                            $cataThr.find('.cur_play').removeClass('cur_play activity');//清空选中的
                            $(n).addClass('activity cur_play'); //大屏
                            $cataThr.find('[time="'+$(n).attr('time')+'"]:last').addClass('cur_play cur_play');//三分屏 根据时间选中
                        }
                    }
                });
            },
            //视频调整后设置对应讲义
            setCurHandout: function (type) {
                if(!type.hasClass('playing')){
                    var pre = type.addClass('playing select_listen').siblings('.playing').removeClass('playing select_listen');
                    $(" p:first", pre).removeClass('little_p').children('.lecture_title').remove();
                    $(" p:first", type).addClass('little_p').prepend('<span class="iconfont lecture_title"></span>');
                    listenView.data.curLecture = type;
                    if(listenView.data.small){
                        $('html,body').animate({scrollTop:type.offset().top}, 100);
                    }else{
                        var lecture = $('#lecture');
                        lecture.animate({scrollTop: type.offset().top+lecture.scrollTop() - lecture.offset().top}, 100);
                    }
                    /*
                     * 回选目录列表
                     * video_list 大屏
                     * listen_course_list 三分屏
                     * */
                    /*var $cataBig = $('#video_list'), //大屏目录
                     $cataThr = $('.listen_course_list'); //三分屏目录
                     $cataBig.find('.activity').removeClass('activity');	//清空选中的
                     $cataBig.find('[time="'+type.attr('time')+'"]').addClass('activity'); //根据时间选中
                     $cataThr.find('.cur_play').removeClass('cur_play'); //清空选中的
                     $cataThr.find('[time="'+type.attr('time')+'"]').addClass('cur_play'); //根据时间选中
                     */
                }
            },
            //开启弹窗
            //0：题 1：详细  2：笔记  3：针对该题提问  4:删除笔记  5：针对该题提问无答疑 6：提问成功  7:提问  8：提问无答疑
            showBox: function (type) {
                video.pauseVideo();
                if (type === 4) {
                    //弹起遮罩层
                    tool.showMaskSco({ele: $('.cancelAsk')});
                } else {
                    if(type>4){
                        --type;
                    }
                    if (type == 0) {
                        //听完课程去做题的页面展示
                        $('.question .pop_box_content>p:first,.question .pop_box_content>div:first').show();
                        $('.question .pop_box_content>p:first').addClass('show');
                    }
                    //展示弹窗
                    $('.lister_pop_box').show().children(':eq(' + type + ')').show().siblings().hide();
                    //弹起遮罩层
                    tool.showMask({ele: $('.lister_pop_box')});
                }
            },
            //关闭弹窗
            closeBox: function () {
                video.playVideo();
                //隐藏遮罩层
                tool.hideMask();
                //隐藏弹窗
                $('.lister_pop_box').hide();
            },
            //视屏窗口拖拽
            dragBox: function (box) {
                var title = box.children('div:first');
                var disX = 0, disY = 0;
                var posX = 0, posY = 0;
                var maxW, maxH;
                title.off('mousedown').on('mousedown', function (event) {
                    if ($(event.target).hasClass('audio_title_img') || event.target.tagName.toLowerCase() == 'img') {
                        return false;
                    }
                    /* 判断是否是已经开始播放，如果没有开始播放 ，则说明目前是 正在播放片头*/
                    if($('.fla-no').is(':visible') || (video.getVideoStatus() != 'play' && listenView.data.isHead == true)){
                        //正在播放片头 设置标识 并且不暂停
                        listenView.data.isHead = true;
                    }else{
                        //不是片头，暂停播放
                        video.pauseVideo();
                        listenView.data.isHead = false;//去掉片头的标识
                    }
                    var event = event || window.event;
                    disX = event.offsetX;
                    disY = event.offsetY;
                    maxW = $(window).width() - box.width() - 4;
                    maxH = $(window).height() - box.find('.audio_title').height() - box.find('#container').height() - 4;
                    $(document).on({
                        mousemove: function (event) {
                            var event = event || window.event;
                            posX = event.clientX - disX;
                            posY = event.clientY - disY;
                            posX = Math.max(posX, 0);
                            posY = Math.max(posY, 0);
                            posX = Math.min(posX, maxW);
                            posY = Math.min(posY, maxH);
                            box.css({
                                left: posX,
                                top: posY,
                                right: 'initial',
                                margin: "0"
                            });
                        },
                        mouseup: function () {
                            /*判断是否是已经开始播放，如果没有开始播放 ，则说明目前是 正在播放片头*/
                            if($('.fla-no').is(':visible') || (video.getVideoStatus() != 'play' && listenView.data.isHead == true)){
                                //正在播放片头 设置标识 并且不暂停
                                listenView.data.isHead = true;
                            }else{
                                //不是片头，开始播放
                                video.playVideo();
                                listenView.data.isHead = false;//去掉片头的标识
                            }
                            $(document).off('mousemove');
                            $(document).off('mouseup');
                        }
                    });
                });
            },
            //编写笔记绑定事件
            editNote: function (_this) {
                kpName = _this.attr("name");
                if(kpName == undefined || kpName == 'undefined'){
                    kpName = "";
                }
                //获取笔记框html
                var sectionid = _this.parent().parent().attr('id'),
                    box = listenView.handler.getNoteBoxHtml({
                        sectionid:sectionid,
                        action:'add',
                        title:kpName,
                        hanConId:_this.val()
                    });
                //var before = _this.parent().prev();
                /*if(before.hasClass('que_answer')){
                 before.before(box);
                 }else{
                 before.after(box);
                 }*/
                tool.showMaskSco({
                    ele: box,
                    pop: '.editQues',
                    callback: function () {
                        //编写/修改笔记行内框-保存按钮
                        $('.editQues .p_sure').off().on('click', function () {
                            //video.playVideo();
                            listenView.handler.noteBoxSure($(this), sectionid);
                        });
                        //编写/修改笔记行内框-取消按钮/关闭按钮
                        $('.editQues .close,.editQues .p_concel').off().on('click', function () {
                            video.playVideo();
                            listenView.handler.noteBoxCanl($(this));
                        });
                        $('.editQues .inp_area').off().on({
                            'input propertychange': function () {
                                var $this = $(this),
                                    val = this.value;
                                $('.text-area-len label').html(500 - val.length);
                                /*if (val.length > 500) {
                                 this.value = val.substring(0, 500);
                                 $('.text-area-len label').html(0);
                                 }*/
                            }
                        });
                        $('.editQues').on('click','.erro_SH',function(){
                            $(this).parent().remove();
                            $(".Gexa_span").html($(".load_imgD").length);
                        });
                        listenView.dragBox($('.editQues'));
                    }
                })
                _this.hide().next().show();
                //_this.off().addClass('btn_gray');
            },
            //获取行内笔记框html
            getNoteBoxHtml:function(param){
                /*var box = '\
                 <div class="note_box">\
                 <div class="note_box_title clearfix">\
                 <span class="fl">编写笔记</span>\
                 <span class="fr note_box_close" action="'+param.action+'" sectionid="'+param.sectionid+'">关闭</span>\
                 </div>\
                 <div class="note_box_content">\
                 <div class="note_box_content_title ">\
                 <span>标题：</span>\
                 <input type="text" maxlength="30" value="'+(param.title || '' )+'"/>\
                 <b>（30个字符以内）</b>\
                 <p class="register_tip_err clearfix">\
                 <span class="register_tip_icon register_tip_icon_error"></span>\
                 <span class="register_tip_info">标题不能为空</span>\
                 </p>\
                 </div>\
                 <div class="note_box_content_content clearfix">\
                 <span class="fl">内容：</span>\
                 <textarea class="fl">'+(param.content || '')+'</textarea>\
                 <p class="register_tip_err clearfix fl">\
                 <span class="register_tip_icon register_tip_icon_error"></span>\
                 <span class="register_tip_info">内容不能为空</span>\
                 </p>\
                 </div>\
                 </div>\
                 <div class="note_box_footer clearfix">\
                 <div class="note_box_btn_canl" action="'+param.action+'" sectionid="'+param.sectionid+'">取&nbsp;消</div>\
                 <div id="'+param.noteId+'" class="note_box_btn_save" value="'+param.hanConId+'" action="'+param.action+'" sectionid="'+param.sectionid+'">保&nbsp;存</div>\
                 </div>\
                 </div>';*/
                var noteArr =  ['<div class="pop pop_box_content editQues">',
                    '        <div class="pop_title">',
                    '            <span class="pop_title_tip font16">'+(param.action == 'add'?'编写笔记':'修改笔记')+'</span>',
                    '            <div class="close" action="' + param.action + '" sectionid="' + param.sectionid + '"></div>',
                    '        </div>',
                    '        <div class="pop_container">',
                    '            <div class="pop_content clearfix">',
                    '                <div class="v_show mart20 clearfix">',
                    '                <div class="clearfix">',
                    '                    <div class="inp_label inp_label_tit">标题：</div>',
                    '                    <span class="tit_info fr">30个字符以内</span>',
                    '                </div>',
                    '                    <input id="title_text" class="ba_bor inp_text" maxlength="30" value="' + (param.title || '') + '" type="text">',
                    '                </div>',
                    '                <div class="mart16 clearfix">',
                    '                <div class="clearfix">',
                    '                    <div class="inp_label inp_label_tit">内容：</div>',
                    '                    <span class="text-area-len fr">还可输入<label>500</label>个字</span>',
                    '                </div>',
                    '                    <textarea id="content_text" class="ba_bor inp_area">' + (param.content || '') + '</textarea>',
                    '                </div>',
                    '            </div>',
                    '			<div class="">',
                    '				<div class="exa_upload clearfix">',
                    '					<p class="Bexa_p">添加图片：</p>',
                    '					<p class="Gexa_p"><span class="Gexa_span">0</span>/3，每张图片文件小于4M，仅支持JPG、PNG、JPEG、BMP格式。</p>',
                    '				</div>',
                    '				<div class="mr15 clearfix">',
                    '					<div class="ulL_img">',
                    '						<img src="'+rp + rv +'/static/questions/images/jiahao.png" class="fil_img">',
                    '						<form id="picForm"  method="post"  action="'+basePath+'/note/uploadNotePic" enctype="multipart/form-data">',
                    '						    <input type="file" class="fil_ex" name="picFile" id="doc" accept="image/jpeg,image/jpg,image/bmp,image/png">',
                    '						</form >',
                    '					</div>',
                    '					<div id="localImag" class="fl">'];
                //加载笔记上传的图片
                if(param.imglist && param.imglist.length>0){
                    $.each(param.imglist,function(i){
                        var img = param.imglist[i];
                        noteArr.push('<div class="load_imgD fl">',
                            '   <div class="erro_SH hide">',
                            '	    <img class="load_cha" src="'+rp+rv+'/static/questions/images/cha.png">',
                            '       <div class="load_zhe"></div>',
                            '   </div>',
                            '   <img style="display: block; width: 36px; height: 36px;" src="'+img+'" class="load_pic">',
                            '</div>');
                    });
                }

                noteArr.push('					</div>',
                    '					<p class="erro_ti">',
                    '						<span class="three_pic">最多可添加3张图片</span>',
                    '						<span style="display:none;">上传图片文件请在4M以内</span>',
                    '					</p>',
                    '				</div>',
                    '			</div>',
                    '        </div>',
                    '        <div class="pop_bottom mart0 clearfix">',
                    '            <div class="pop_btn p_concel fl" action="' + param.action + '" sectionid="' + param.sectionid + '">取&nbsp;消</div>',
                    '            <div id="'+param.noteId+'" class="pop_btn p_sure fl" action="' + param.action + '" value="'+param.hanConId+'" sectionid="' + param.sectionid + '">确&nbsp;定</div>',
                    '        </div>',
                    '    </div>');
                return noteArr.join("");
            },
            //获取panal空时html
            getPanalNoHtml:function(){
                return '\
					<div class="panal_no_content">\
						<img src = "'+rp+rv+'/static/course/img/listen_panal_no_content.png"/>\
						<p>未发现本讲的相关内容</p>\
					</div>';
            },
            //行内框添加笔记确认事件
            noteBoxSure: function (_this, id) {
                var content = _this.parent().prev(),
                    infos = [];
                content.find('.pop_content input,textarea').each(function () {
                    if ($(this).val() == '') {
                        $(this).addClass('border_red');
                    }else{
                        infos.push($(this).val());
                        $(this).siblings('.register_tip_err').hide();
                    }
                });
                //添加笔记校验通过
                if(infos.length === 3 || infos.length===2){
                    //title空
                    if(infos[0].trim()==""){
                        DA.showFailMask("笔记标题不能为空！");
                        return;
                    }
                    //内容空
                    if(infos[1].trim()==""){
                        DA.showFailMask("笔记内容不能为空！")
                        return;
                    }
                    if(infos[1].trim().length>500){
                        //DA.showFailMask("笔记内容不能超过500字");
                        content.find('textarea').addClass('border_red');
                        return;
                    }
                    /******调用新增笔记接口保存数据库start********/
                    var tempNoteId = null;
                    var courseId = $("#courseId").val();
                    var lectrueId = $("#lectureId").val();
                    var hanConId = _this.attr("value");
                    var noteId = _this.attr("id");
                    var title = infos[0];
                    var playedTime = Math.round(video.getCurrentVideoTime());
                    var sSubjectId = $('#sSubjectId').val();
                    playedTime = formatTime(playedTime);
                    var imgSrcs="";
                    $("#localImag").find(".load_pic").each(function(i){
                        imgSrcs += $(this).attr("src")+",";
                    });
                    if (imgSrcs.length > 0) {
                        imgSrcs = imgSrcs.substr(0, imgSrcs.length - 1);
                    }
                    if(hanConId == 'undefined' || hanConId == undefined){
                        hanConId = null;
                    }
                    if(noteId == 'undefined' || noteId == undefined){
                        noteId = null;
                    }
                    $.ajax({
                        url: basePath+'/note/add',
                        type: 'POST',
                        dataType: 'JSON',
                        async: false,
                        data: {
                            'id':noteId,
                            'courseId':courseId,
                            'lectrueId':lectrueId,
                            'hanConId':hanConId,
                            'content':infos[1],
                            'coursewareTime':playedTime,
                            'title':title,
                            'sSubjectId':sSubjectId,
                            'picPaths':imgSrcs
                        },
                        error: function() {  },
                        success: function(result) {
                            if(result.success){
                                //设置笔记id值
                                tempNoteId = result.obj;

                            }else{
                                DA.showFailMask(result.msg);
                            }
                        }
                    });
                    /******调用新增笔记接口保存数据库end********/
                    var sectionid = id;
                    var noteImgs="";
                    if($("#localImag").find(".load_pic").length>0){
                        noteImgs += '<div class="small_pic clearfix">';
                        $("#localImag").find(".load_pic").each(function(i){
                            var attr = $(this).attr("src");
                            noteImgs += '<img src="'+attr+'" class="small_img">&nbsp;';
                        });
                        noteImgs += '</div>'
                    }
                    //新增功能
                    if(_this.attr('action') === 'add'){
                        //笔记列表增加笔记
                        var noteTitle = infos[0].length>20?infos[0].substring(0,18)+"...":infos[0];
                        var note = '\
						<li class="clearfix" id="'+tempNoteId+'" sectionid="'+sectionid+'">\
							<p class="fl note_detail_text" title="'+infos[0]+'">'+noteTitle+'</p>\
							<p class="fr clearfix note_icon_btns">\
								<span class="note_update_btn"></span>\
								<span class="note_delete_btn"></span>\
							</p>\
						</li>';
                        var noteList = $('.listen_note_panl>.note_list');
                        if(noteList.length > 0){
                            noteList.prepend(note);
                        }else{
                            $('.listen_note_panl').html($('<ul>',{
                                html:note
                            }).addClass('note_list'));
                        }
                        //讲义增加笔记
                        note = '\
						<div class="note_detail" sectionid="'+sectionid+'">\
							<div class="note_detail_title">\
								<span class="icon">学习笔记</span>\
								<!--<a  value="'+tempNoteId+'" class="note_detail_update_btn">修改</a>-->\
								<!--<span>|</span>-->\
								<a id="deleteNoteBtn" value="'+tempNoteId+'" class="note_delete_btn"></a>\
							</div>\
							<div class="note_detail_content">\
								<p>'+infos[0]+'</p>\
								<p>'+infos[1]+'</p>'+noteImgs+'\
							</div>\
						</div>';
                        $('#' + id).find('.chico').before(note);
                        $('#' + id).find('.chico li:eq(3)').hide().next().show().attr('value',tempNoteId);
                        //content.parent().after(note);
                        //content.parent().remove();
                        tool.hideMaskSco();
                        video.playVideo();
                    }
                    //修改功能
                    else if(_this.attr('action') === 'update'){
                        //移除框
                        //content.parent().remove();
                        tool.hideMaskSco();
                        video.playVideo();
                        //开始修改值
                        $('#bigScreen [sectionid='+sectionid+']').each(function(){
                            if($(this).hasClass('note_detail')){
                                $('p:first',$(this)).html(infos[0]);
                                $('p:last',$(this)).html(infos[1]);
                                $('p:last',$(this)).next().remove();
                                $('p:last',$(this)).after(noteImgs);
                                $(this).show();
                            }else{
                                var noteTitle = infos[0].length>20?infos[0].substring(0,18)+"...":infos[0];
                                $(this).children(':first').attr("title",infos[0]);
                                $(this).children(':first').html(noteTitle);

                            }
                        });
                    }
                }
            },
            //删除笔记
            noteDelte:function(_this){
                //删除数据库该笔记
                $.ajax({
                    url: basePath+'/note/del',
                    type: 'POST',
                    dataType: 'JSON',
                    async: false,
                    data: {
                        'id':$("#deleteNoteBtn").val()
                    },
                    error: function() {  },
                    success: function(result) {
                        if(result.success){

                        }
                    }
                });
                $('#bigScreen [sectionid='+listenView.data.deleteNoteSectionId+']').remove();
                /*$('#'+listenView.data.deleteNoteSectionId+' .chico .btn_gray').removeClass('btn_gray').on('click',function(){
                 video.pauseVideo();
                 listenView.handler.editNote($(this));
                 });*/
                $('#' + listenView.data.deleteNoteSectionId + ' .chico li:eq(3)').show().next().hide();
                if($('.note_list>li').length === 0){
                    $('.listen_note_panl').html(listenView.handler.getPanalNoHtml());
                }
                listenView.handler.closeBox();
            },
            //行内添加笔记取消事件
            noteBoxCanl:function(_this){
                var section = $('#'+_this.attr('sectionid'));
                var box = section.children('.note_box');
                if(_this.attr('action') === 'add'){
                    /*section.children('.chico').children('.btn_gray').removeClass('btn_gray').on('click',function(){
                     video.pauseVideo();
                     listenView.handler.editNote($(this));
                     });*/
                    section.children('.chico').children('li:last').hide().prev().show()
                }else if(_this.attr('action') === 'update'){
                    section.children('.note_detail').show();
                }
                //box.remove();
                tool.hideMaskSco();
            },
            //行内修改笔记
            noteLineUpdate:function(_this){
                var parent = _this.parent();
                var imgArr = [];
                var imgs = parent.prevAll('.note_detail').find('img');
                if(imgs!=null){
                    imgs.each(function(i){
                        imgArr.push($(this).attr("src"));
                    });
                }
                var param = {
                    action:'update',
                    noteId:_this.attr("value"),
                    sectionid: parent.prevAll('.note_detail').attr('sectionid'),
                    title: parent.prevAll('.note_detail').find('.note_detail_content').children(':first').html(),
                    content: parent.prevAll('.note_detail').find('.note_detail_content').children('p:eq(1)').html(),
                    imglist:imgArr
                };
                var box = listenView.handler.getNoteBoxHtml(param);
                //parent.parent().after(box);
                tool.showMaskSco({
                    ele: box,
                    pop: '.editQues',
                    callback: function () {
                        //编写/修改笔记行内框-保存按钮
                        $('.editQues .p_sure').off().on('click', function () {

                            listenView.handler.noteBoxSure($(this), param.sectionid);
                        });
                        if(!tool.validation.isNull(param.content)){
                            $('.editQues .text-area-len label').html(500 - param.content.length);
                        }
                        //编写/修改笔记行内框-取消按钮/关闭按钮
                        $('.editQues .close,.editQues .p_concel').off().on('click', function () {
                            video.playVideo();
                            listenView.handler.noteBoxCanl($(this));
                        });
                        $('.editQues .inp_area').off().on({
                            'input propertychange': function () {
                                var $this = $(this)
                                    ,$limt = $('.text-area-len');
                                if($limt.length > 0){
                                    $limt.find('label').html(500 - this.value.length);
                                }
                            }
                        });
                        //删除图片
                        $('.editQues').on('click','.erro_SH',function(){
                            $(this).parent().remove();
                            $(".Gexa_span").html($(".load_imgD").length);
                        });
                        //图片个数
                        $(".Gexa_span").html($(".load_imgD").length);
                        listenView.dragBox($('.editQues'));
                    }
                });
                parent.prevAll('.note_detail').hide();
            },
            //icon修改笔记
            noteIconUpdate:function(_this){
                listenView.data.deleteNoteSectionId = _this.parent().parent().attr('sectionid');
                //listenView.handler.showBox(2);
                var note = $('#'+listenView.data.deleteNoteSectionId+' div[sectionid='+listenView.data.deleteNoteSectionId+']');
                var imgArr = [];
                var imgs = note.find('img');
                if(imgs!=null){
                    imgs.each(function(i){
                        imgArr.push($(this).attr("src"));
                    });
                }
                var param = {
                    action: 'update',
                    noteId: _this.parent().parent().attr('id'),
                    sectionid: listenView.data.deleteNoteSectionId,
                    title: note.find('p:first').html(),
                    content: note.find('p:last').html(),
                    imglist:imgArr
                };
                var title = $('#note_pop_box_title');
                //var noteId = _this.parent().parent().attr('id');
                var box = listenView.handler.getNoteBoxHtml(param);
                tool.showMaskSco({
                    ele: box,
                    pop: '.editQues',
                    callback: function () {
                        //编写/修改笔记行内框-保存按钮
                        $('.editQues .p_sure').off().on('click', function () {
                            //video.playVideo();
                            listenView.handler.noteBoxSure($(this), param.sectionid);
                        });
                        if(!tool.validation.isNull(param.content)){
                            $('.editQues .text-area-len label').html(500 - param.content.length);
                        }
                        //编写/修改笔记行内框-取消按钮/关闭按钮
                        $('.editQues .close,.editQues .p_concel').off().on('click', function () {
                            video.playVideo();
                            listenView.handler.noteBoxCanl($(this));
                        });
                        //删除图片
                        $('.editQues').on('click','.erro_SH',function(){
                            $(this).parent().remove();
                            $(".Gexa_span").html($(".load_imgD").length);
                        });
                        //图片个数
                        $(".Gexa_span").html($(".load_imgD").length);
                        listenView.dragBox($('.editQues'));
                        $('.editQues .inp_area').off().on({
                            'input propertychange': function () {
                                var $this = $(this),
                                    val = this.value;
                                $('.text-area-len label').html(500 - val.length);
                                /*if (val.length > 500) {
                                 this.value = val.substring(0, 500);
                                 $('.text-area-len label').html(0);
                                 }*/
                            }
                        });
                        listenView.dragBox($('.editQues'));
                    }
                });

                /*if(note.find('p:first').html() === '无标题'){
                 title.parent().addClass('pop_box_note_title_hidden');
                 title.siblings('#add_note_title').html('+增加标题');
                 }else{
                 title.parent().removeClass('pop_box_note_title_hidden');
                 title.siblings('#add_note_title').html('-删除标题');
                 }*/
                //title.val(note.find('p:first').html());
                //$('#note_pop_box_content').val(note.find('p:last').html());
                $("#noteSave").val(noteId);
            },
            //弹框修改笔记确认按钮
            noteBoxUpdateSure:function(){
                var content = $('.pop_box_note .pop_box_content'),
                    infos = [];
                content.find('input,textarea').each(function () {
                    if ($(this).val() == '') {
                        $(this).siblings('.register_tip_err').show();
                    }else{
                        infos.push($(this).val());
                        $(this).siblings('.register_tip_err').hide();
                    }
                });
                if(infos.length === 2){
                    if(infos[1] && infos[1].length>500){
                        listenView.handler.closeBox();
                        DA.showFailMask("笔记内容不能超过500字");
                        return false;
                    }
                    //修改的笔记信息保存数据库
                    $.ajax({
                        url: basePath+'/note/add',
                        type: 'POST',
                        dataType: 'JSON',
                        async: false,
                        data: {
                            'id':$("#noteSave").val(),
                            'content':infos[1],
                            'title':infos[0]
                        },
                        error: function() {  },
                        success: function(result) {
                            if(!result.success){
                                DA.showFailMask(result.msg);
                            }
                        }
                    });
                    //开始修改值
                    $('#bigScreen [sectionid='+listenView.data.deleteNoteSectionId+']').each(function(){
                        if($(this).hasClass('note_detail')){
                            $('p:first',$(this)).html(infos[0]);
                            $('p:last',$(this)).html(infos[1]);
                            $(this).show();
                        }else{
                            var noteTitle = infos[0].length>20?infos[0].substring(0,18)+"...":infos[0];
                            $(this).children(':first').attr("title",infos[0]);
                            $(this).children(':first').html(noteTitle);
                        }
                    });
                    listenView.handler.closeBox();
                }
            },
            //点击笔记对应 滚动到对应讲义
            noteScroll:function(_this){
                var curWindow = listenView.data.curWindow || listenView.conf.initPageType,
                    sectionid = _this.parent().attr('sectionid');
                if (curWindow === 'big') {
                    window.scrollTo(0, $('.note_detail[sectionid=' + sectionid+']').offset().top - 40);
                } else if (curWindow === 'three') {
                    $('#lecture').animate({
                        scrollTop: ($('#lecture').scrollTop() + $('.note_detail[sectionid=' + sectionid+']').offset().top - $('#lecture').offset().top - 40 + 'px')
                    });
                }
            },
            //视频列表目录悬浮事件
            videoNameHover:function(_this){
                var _thisW = _this[0].scrollWidth,
                    pl = parseInt(_this.css('padding-left')),
                    pr = parseInt(_this.css('padding-right'));
                var text = _this.html();
                _this.attr({
                    html:text
                });
                var html = '\
					<span course style="position: relative;color:#FEC08A;margin:0;height:36px;line-height:36px;top:0;left:-'+pl+'px;display: block;width:'+(_thisW*2)+'px">\
						<span style="padding-left:'+pl+'px">'+text+'</span>\
						<span style="padding-left:'+pl+'px">'+text+'</span>\
					</span>';
                _this.html(html);
                listenView.handler.videoNameMove(_this,_thisW,pl,pr);
            },
            //视频列表目录离开事件
            videoNameLive:function(_this){
                _this.html(_this.attr('html'));
            },
            //视频名称滚动
            videoNameMove:function(_this,_thisW,pl,pr){
                _this.children(':first').animate({left:'-=1px'},20,function(){
                    if(Math.abs(parseInt(_this.children(':first').css('left'))+pl+pr) >= _thisW){
                        _this.children(':first').css('left',-pl);
                    }
                    if(_this.children().length == 0){
                        return false;
                    }
                    listenView.handler.videoNameMove(_this,_thisW,pl,pr);
                });
            }
        },
        //页面绑定事件
        onFun : function(){
            $("#first").change(function(){
                var val = $(this).children('option:selected').val();
                if(val) {
                    bindSecond(val);
                }
            });
            $("#load").on('click',function(){
                var requestURL = $('#second option:selected').val();
                if(requestURL) {
                    $("#requestURL").val(requestURL);
                    init();
                }
            });
            //评价提示框文字
            $('.pop_lesson_evaluate textarea').on('input propertychange',function(){
                var _this = $(this);
                _this.siblings('.lesson_alt_t').hide();
                $('.pop_lesson_evaluate textarea').removeClass('err-les'); //清掉错误边框
                var val=_this.val();
                $('.lesson_alt_n>b').html(140-val.length);
                if(tool.validation.isNull(val)){
                    $('.lesson_alt_t').show();
                }else{
                    $('.lesson_alt_t').hide();
                }
            })
            //评价星
            $('.erro_star a').on('click',function(){
                $(this).addClass('star_cur').prevAll('a').addClass('star_cur');
                $(this).nextAll('a').removeClass('star_cur');
                //判断对哪项评分
                var attrName = $(this).parent().attr("name");
                var score = $(this).index();
                if(attrName=="beautiful"){
                    beautifulScore = 1;
                    beautifulScore += score;
                }else if(attrName=="attract"){
                    attractScore = 1;
                    attractScore += score;
                }else if(attrName=="reasonable"){
                    reasonableScore = 1;
                    reasonableScore += score;
                }
            })
            //点击评价
            $('.lesson_evaluate_pop').on('click', function () {
                if($('.lesson_evaluate_pop_icon ').hasClass('lesson_evaluate_active')){
                    $('.lesson_evaluate_pop').off("click");
                }else{
                    video.pauseVideo();
                    $('.pop_opcity').show();
                }
            });
            //评价关闭
            $('.lesson_title_close').on('click',function(){
                $(this).parents('.pop_opcity').hide();
                video.playVideo();
            })
            //提交提示
            $('.lesson_evaluate_btn').on('click',function(){
                var val= $('.pop_lesson_evaluate textarea').val();
                $('.pop_lesson_evaluate textarea').removeClass('err-les'); //清掉错误边框
                if(val.length==0){
                    $('.pop_lesson_cont_alt').eq(0).show();
                    $('.pop_lesson_evaluate textarea').addClass('err-les'); //增加错误边框
                    setTimeout(function(){$('.pop_lesson_cont_alt').eq(0).hide();},3000);
                }else
                if(val.length>0 && val.length<=140){
                    var examId = $("#examId").val();
                    var subjectId = $("#subjectId").val();
                    var sSubjectId = $("#sSubjectId").val();
                    var courseId = $("#courseId").val();
                    var lectureId = $("#coursewareId").val();
                    //保存课程评价数据
                    $.ajax({
                        url: basePath+'/courseEvaluate/save',
                        type: 'POST',
                        dataType: 'JSON',
                        async: false,
                        data : {
                            "examId":examId,
                            "subjectId":subjectId,
                            "sSubjectId":sSubjectId,
                            "courseId":courseId,
                            "lectureId":lectureId,
                            "beautifulScore":beautifulScore,
                            "attractScore":attractScore,
                            "reasonableScore":reasonableScore,
                            "content":val
                        },
                        error: function() {  },
                        success: function(result) {
                            if(result.success){
                                $('.pop_lesson_cont').hide();
                                $('.pop_lesson_cont1').show();
                                //设置评价按钮
                                $('.lesson_evaluate_pop_icon ').addClass("lesson_evaluate_active");
                                $('.lesson_evaluate_pop_icon ').next().html("课程已评价");
                                setTimeout(function(){
                                    $('.pop_opcity').hide();
                                    //视频开始播放
                                    video.playVideo();
                                }, 3000);
                            }else{
                                $('.pop_lesson_cont_alt').eq(1).show();
                                setTimeout(function(){$('.pop_lesson_cont_alt').eq(1).hide();},3000);
                            }
                        }
                    });
                    /*$('.pop_lesson_cont').delay(10000).show();
                     $('.pop_lesson_cont1').delay(10000).hide();*/
                }else{
                    $('.pop_lesson_evaluate textarea').addClass('err-les'); //增加错误边框
                    /*$('.pop_lesson_cont_alt').eq(1).show();
                     setTimeout(function(){$('.pop_lesson_cont_alt').eq(1).hide();},3000);*/
                }
            });
            //评价标题字数控制
            var min_num=7;
            if($('.lesson_names').text().length>min_num){
                $('.lesson_names').text($('.lesson_names').text().substring(0, min_num));
                $('.lesson_names').text($('.lesson_names').text()+"...");
            };

            var max_num=10;
            if($('.lesson_name_n').text().length>max_num){
                $('.lesson_name_n').text($('.lesson_name_n').text().substring(0, max_num));
                $('.lesson_name_n').text($('.lesson_name_n').text()+"...");
            };
            //点击三分屏时的目录节点
            $('.listen_course_list').on("click","a[time]",function(){
                var time = $(this).attr("time"),
                    ft = Math.round(parseTime2Second(time));
                listenView.data.flag = ft;
                listenView.handler.initHandout(['clickthree',ft+1]);
                video.seekVideo(ft);
            });

            //视频列表悬浮滚动事件 章 第一级
            $('.video_list>ul>li>p').on('mouseenter',function(){
                var _this = $(this);
                testW(function(w){
                    if(w <= 265){
                        $(this).addClass('hover-color');
                    }else{
                        listenView.handler.videoNameHover(_this);
                    }
                },_this,14);
            });
            // 讲	第二级
            $('.video_list>ul>li>ul>li>p').on('mouseenter',function(){
                var _this = $(this);
                testW(function(w){
                    if(w <= 244){
                        $(this).addClass('hover-color');
                    }else{
                        listenView.handler.videoNameHover(_this);
                    }
                },_this,12);
            });
            //知识点
            $('.video_list a').on('mouseenter',function(){
                var _this = $(this);
                testW(function(w){
                    if(w <= 210){
                        $(this).addClass('hover-color');
                    }else{
                        listenView.handler.videoNameHover(_this);
                    }
                },_this,12);
            });
            function testW(callback,_this,fontsize){
                var $p = null,$list = $('#video_list');
                if($('#testWidth').length > 0){
                    $p = $('#testWidth');
                    $p.css('font-size',fontsize+'px');
                    $p.html(_this.html());
                }else{
                    $p = $('<p>',{
                        id:'testWidth',
                        'class': 'hidden',
                        html: _this.html(),
                        'style':'font-size:'+fontsize+'px'
                    }).appendTo('body');
                }
                callback($p.width()+($list.find('.firstul').height() > 450? 10:0));
                //$p.remove();
            }
            //视频列表离开事件
            $('.video_list p,.video_list a').on('mouseleave',function(){
                $(this).removeClass('hover-color');
                listenView.handler.videoNameLive($(this));
            });
            //跳转计算器页面
            $('.head_right p:eq(1)').click(function(){
                window.open(rp+rv+'/static/common/html/calculator.html');
            });
            //跳转提建议页
            $('.head_right p:eq(2)').click(function(){
                window.open(basePath+'/suggest');
            });
            //编写笔记按钮
            $('li:eq(3)',$('.chico')).on('click',function() {
                video.pauseVideo();
                listenView.handler.editNote($(this));
            });
            //修改笔记-行内
            $('li:last', $('.chico')).on('click', function () {
                video.pauseVideo();
                listenView.handler.noteLineUpdate($(this));
            });
            /*$('#bigScreen').on('click','.note_detail_update_btn',function(){
             video.pauseVideo();
             listenView.handler.noteLineUpdate($(this));
             });*/
            //编写/修改笔记行内框-保存按钮
            $('.section').on('click','.note_box_btn_save',function(){
                //video.playVideo();
                listenView.handler.noteBoxSure($(this));
            });
            //编写/修改笔记行内框-取消按钮/关闭按钮
            $('.section').on('click','.note_box_btn_canl,.note_box_close',function(){
                video.playVideo();
                listenView.handler.noteBoxCanl($(this));
            });
            //修改笔记-tab_icon
            $('#bigScreen').on('click','.note_update_btn',function(){
                video.pauseVideo();
                listenView.handler.noteIconUpdate($(this));
            });
            /*//修改笔记弹窗增加title按钮
             $('#add_note_title').on('click',function(){
             if($(this).parent().hasClass('pop_box_note_title_hidden')){
             $(this).prev().prev().val('');
             $(this).html('-删除标题').parent().removeClass('pop_box_note_title_hidden');
             }else{
             $(this).prev().prev().val('');
             $(this).html('+增加标题').parent().addClass('pop_box_note_title_hidden');
             $(this).siblings('.register_tip_err').hide();
             }
             });*/
            //修改笔记弹窗确认事件
            $('.pop_box_note_btns>.pop_box_note_btn_save').on('click',function(){
                video.playVideo();
                listenView.handler.noteBoxUpdateSure();
            });
            //修改笔记弹窗取消事件
            $('.pop_box_note_btns>.pop_box_note_btn_canl').on('click',function(){
                video.playVideo();
                listenView.handler.closeBox();
            });
            //删除笔记按钮-tab_icon/行内
            $('#bigScreen').on('click','.note_delete_btn,.note_detail_delete_btn',function(){
                //将要删除的笔记的id赋值给删除按钮
                if($(this).attr("value") == null){
                    $("#deleteNoteBtn").val($(this).parent().parent().attr("id"));
                }else{
                    $("#deleteNoteBtn").val($(this).attr("value") );
                }
                video.pauseVideo();
                listenView.data.deleteNoteSectionId = $(this).parent().parent().attr('sectionid');
                listenView.handler.showBox(4);
            });
            //删除笔记弹窗-确认按钮
            $('.p_sure').on('click',function(){
                video.playVideo();
                listenView.handler.noteDelte(this);
            });
            //删除笔记弹窗-取消按钮/关闭按钮
            $('.p_concel,.pop_title_close').on('click',function(e){
                video.playVideo();
                listenView.handler.closeBox();
                if ( e && e.stopPropagation ){
                    e.stopPropagation();
                }else{
                    window.event.cancelBubble = true;
                }
            });
            //点击笔记对应 滚动到对应讲义
            $('.listen_note_panl').on('click','.note_detail_text',function() {
                listenView.handler.noteScroll($(this));
            });
            //习题详解弹框-收藏/已收藏按钮
            $('.collection1,.collection_text',$('.box_content_question_type')).on('click',function(){
                var _this = $(this);
                if(_this.hasClass('collection_text')){
                    _this = _this.next();
                }
                if(_this.hasClass('collection1_act')){
                    _this.prev().html('收藏');
                }else{
                    _this.prev().html('已收藏');
                }
                _this.toggleClass('collection1_act');
            });
            //直接提问
            $('.now_ask2').on('click',function(){
                var $per = $(this).parents('.pop_box_question_content');
                $per.find('.qr_help_btn').children('a').addClass('open');
                $per.find('.qr_help_btn').next().show();
                //$('.qr_help_btn').click();
                $per.animate({
                    scrollTop:$per.find('.qr_edit').offset().top
                });
            });

            //展开提问
            $('.qr_help_btn').on('click',function(){
                var $per = $(this).parents('.pop_box_question_content');
                $(this).children('a').toggleClass('open');
                $(this).next().toggle();
                $per.animate({
                    scrollTop: $per.find('.qr_edit').offset().top
                });
            });
            //弹窗修改邮箱按钮
            $('.qrm_change').on('click',function(){
                $('.email_change').show();
            });
            //弹窗修改邮箱按钮
            $('.email_change .sure_btn').on('click',function(){
                //更新邮箱
                email = $(this).parent().prev().find(".email_change_inp").val();
                $.ajax({
                    url: basePath+'/listenLecture/updateEmail',
                    type: 'POST',
                    dataType: 'JSON',
                    async: false,
                    data : {
                        'email' : email
                    },
                    error: function() {  },
                    success: function(result) {
                        if(result.success){
//			    		   $("#answerDate").html(result.obj+"内");
//			    		   listenView.handler.showBox(6);
                        }
                    }
                });

                $('.email_change').hide();
                var box = $(this).parent().parent();
                $('.email_number',box.prev()).text($('.email_change_inp',box).val());
            });
            $('.qr_edit .inp_area').on({
                'input propertychange': function () {
                    var $this = $(this),
                        val = this.value;
                    $this.parent().find('.text-area-len label').html(500 - val.length);
                    /*if (val.length > 500) {
                     this.value = val.substring(0, 500);
                     $this.parent().find('.text-area-len label').html(0);
                     }*/
                }
            });
            //提问弹窗取消
            $('.qr_btn .cancel_btn').on('click',function(){
                listenView.handler.closeBox();
            });
            //提问弹窗确认
            $('.qr_btn .sure_btn').on('click',function(){
                //答疑回复后，是否邮件通知
                if($(this).parent().prev().find("a").hasClass("email_icon_act")){
                    sendStatus = 1;
                }else{
                    sendStatus = 0;
                }

                //提交提问的答疑信息
                handoutDetailId = $("#hanConId").val();
                qaTitle = $(this).parent().parent().prev().find(".inp_text").val();
                qaContent = $(this).parent().parent().prev().find(".inp_area").val();
                lectureId = $("#lectureId").val();
                lectureName = $("#lectureName").val();
                courseId = $("#courseId").val();
                courseName = $("#courseName").val();
                sSubjectId = $("#sSubjectId").val();
                examId = $("#examId").val();
                if(null!=qaTitle && qaTitle!="" && null!=qaContent && qaContent!=""){
                    $.ajax({
                        url: basePath+'/lecture/section/qa/add',
                        type: 'POST',
                        dataType: 'JSON',
                        async: false,
                        data : {
                            'hanConId' : handoutDetailId,
                            'title' : qaTitle,
                            'content' : qaContent,
                            'coursewareId' : lectureId,
                            'coursewareName' : lectureName,
                            'courseId' : courseId,
                            'sSubjectId' : sSubjectId,
                            'examId' : examId,
                            'courseName' : courseName,
                            'sendStatus' : sendStatus
                        },
                        error: function() {  },
                        success: function(result) {
                            if(result.success){
                                //清空填写的数据
                                $("#title").val("");
                                $("#content").val("");
                                $("#answerDate").html(result.obj+"内");
                                listenView.handler.showBox(6);
                            }
                        }
                    });

                }
            });
            //三分屏跳转答疑页面
            $('#threeQaList').on('click','.to_answer',function(){
                var qaId = $(this).attr("qaId");
                video.pauseVideo();
                window.open(toQaDetailUrl+qaId);
            });
            //大视频跳转答疑页面
            $('#rightQaList').on('click','.to_answer',function(){
                var qaId = $(this).attr("qaId");
                video.pauseVideo();
                window.open(toQaDetailUrl+qaId);
            });
            //跳转试题知识点
            $('#bigScreen').on('click','.tab_panal_tests p',function(){
                var sSubjectId = $(this).attr("sSubjectId");
                var kpId = $(this).attr("kpId");
                video.pauseVideo();
                var questionUrl = doQuestionByKpIdUrl.replace("${sSubjectId}",sSubjectId).replace("${kpid}",kpId);
                window.open(questionUrl);
            });
            //跳转笔记页面
            $('.to_note').on('click',function(){
                window.location.href = '../course/note.html';
            });
            //展开讲义答疑详情
            /*$('.qr_has_ask').on('click',function(){
             if($(this).children('i').hasClass('open')){
             $(this).children('span').html('展开');
             }else{
             $(this).children('span').html('收起');
             }
             $(this).children('i').toggleClass('open');
             $(this).parent().find('div.qr_detail').toggle();
             });*/
            //上一讲
            $('.prev_question').on('click',function(){
                var cur = $('.question .pop_box_content>p.show');
                var prev = cur.prev().prev();
                if(prev.length > 0){
                    cur.removeClass('show').hide().next().hide()
                    prev.show().addClass('show').next().show();
                }
            });
            //下一题
            $('.next_question').on('click',function(){
                var cur = $('.question .pop_box_content>p.show');
                var next = cur.removeClass('show').hide().next().hide().next();
                if(next.length > 0){
                    next.show().addClass('show').next().show();
                }else{
                    listenView.handler.showBox(1);
                }
            });
            //播放本段视频
            $('li.chico_play',$('.chico')).on({
                dbclick : function(e){
                    //非IE浏览器
                    if ( e && e.stopPropagation ){
                        e.stopPropagation();
                    }
                    //使用IE的方式来取消事件冒泡
                    else{
                        window.event.cancelBubble = true;
                    }
                    return false;
                },
                click : function() {
                    var time = $(this).parent().parent().attr('time');
                    ft = Math.round(parseTime2Second(time));
                    listenView.data.flag = ft;
                    listenView.handler.initHandout(['clickthree',ft+1]);
                    video.seekVideo(ft);
                },
                mouseover : function(e){
                    var section = $(this).parent().parent();
                    section.data({title:section.attr('title')}).attr('title','');
                },
                mouseout : function(){
                    var section = $(this).parent().parent();
                    section.attr('title',section.data().title);
                }
            });
            //展示隐藏答案
            $('li.chico_answer',$('.chico')).on('click',function(){
                var $obj = $(this);
                var s = $obj.html();
                $obj.html(s == '显示答案' ? '隐藏答案' : '显示答案');
                //答案部分
                $obj.parent().prevAll(".que_answer").toggle();
                return false;
            });
            //提问
            $('li.chico_question',$('.chico')).on({
                dbclick : function(e){
                    //非IE浏览器
                    if ( e && e.stopPropagation ){
                        e.stopPropagation();
                    }
                    //使用IE的方式来取消事件冒泡
                    else{
                        window.event.cancelBubble = true;
                    }
                    return false;
                },
                //点击讲义段的提问按钮，弹框显示答疑页面
                click : function() {
                    video.pauseVideo();
                    //页面对讲义段进行提问的入口，需要查询该讲义段的相关答疑
                    var handoutDetailId = $(this).val();
                    $("#hanConId").attr("value",handoutDetailId);
                    $("#hanDetailId").attr("value",handoutDetailId);
                    var detailContent = $(this).next().val();

                    //$('#qa_questionId').val(1);
                    tool.showMask({
                        ele:'.double_pop',
                        callback:function(){
                            $('.double_pop').css({
                                top: '50%',
                                left: '50%',
                                'margin-left': '-400px',
                                'margin-top': '-300px'
                            });
                            $("#qaInfoForm").attr('action',relateQaRul);
                            $("#qaInfoForm").submit();
                        }
                    });
                    listenView.dragBox($('.double_pop'));//提问拖拽
                },
                hover : function(e){
                    //非IE浏览器
                    if ( e && e.stopPropagation ){
                        e.stopPropagation();
                    }
                    //使用IE的方式来取消事件冒泡
                    else{
                        window.event.cancelBubble = true;
                    }
                    return false;
                },
                mouseover : function(e){
                    var section = $(this).parent().parent();
                    section.data({title:section.attr('title')}).attr('title','');
                },
                mouseout : function(){
                    var section = $(this).parent().parent();
                    section.attr('title',section.data().title);
                }
            });

            //针对该题提问弹框
            $('.que_answer .qu').on('click',function(){
                listenView.handler.showBox(3);
            });

            //小屏关闭按钮
            $('.audio_title_img').on('click',function(e){
                listenView.handler.drawPage('smallclose');
                return false;
            });
            //三分屏左侧tab切换
            $('#three_left_tab tr:first>td').on('click',function(){
                var flag = $(this).attr("flag");
                var lectureId = $("#lectureId").val();
                var subjectId = $("#subjectId").val();

                //加载试题列表
                if(flag=="question"){
                    if(StringUtils.isEmpty($("#threeKpInfos").html().trim())){
                        $("#threeKpInfos").load(basePath+"/lecture/findKpInfos?lectureId="+lectureId,function(){
                            //初始化左侧选项卡高度
                            var _this = $('#three_left_tab_panl .text:eq(2)')
                            var height = $(window).height() - _this.offset().top - 20;
                            height = Math.max(height, 183);
                            if (_this.height() > height) {
                                _this.css({height: height, 'overflow-y': 'auto'})
                            }
                        });
                    }
                }
                //加载笔记列表
                if(flag=="note"){
                    if(StringUtils.isEmpty($("#threeKpNotes").html().trim())){
                        $("#threeKpNotes").load(basePath+"/lecture/findMyNotes?lectureId="+lectureId+"&subjectId="+subjectId,function(){
                            //初始化左侧选项卡高度
                            var _this = $('#three_left_tab_panl .text:eq(3)')
                            var height = $(window).height() - _this.offset().top - 20;
                            height = Math.max(height, 183);
                            if (_this.height() > height) {
                                _this.css({height: height, 'overflow-y': 'auto'})
                            }
                        });
                    }
                }
                //加载答疑列表
                if(flag=="qa"){
                    if(StringUtils.isEmpty($("#threeQaList").html().trim())){
                        $("#threeQaList").load(basePath+"/lecture/findQaInfoList?lectureId="+lectureId,function(){
                            //初始化左侧选项卡高度
                            var _this = $('#three_left_tab_panl .text:eq(1)')
                            var height = $(window).height() - _this.offset().top - 20;
                            height = Math.max(height, 183);
                            if (_this.height() > height) {
                                _this.css({height: height, 'overflow-y': 'auto'})
                            }
                        });
                    }
                }
                $(this).addClass('L_cur').siblings().removeClass('L_cur');
                $('#three_left_tab').nextAll('div.text:eq('+$(this).index()+')').show().siblings('div.text').hide();
            });
            //全屏右侧tab切换
            $('#full_right_tab tr:first>td').on('click',function(){
                var flag = $(this).attr("flag");
                var lectureId = $("#lectureId").val();
                var subjectId = $("#subjectId").val();
                //加载试题列表
                if(flag=="question"){
                    if(StringUtils.isEmpty($("#rightKpInfos").html().trim())){
                        $("#rightKpInfos").load(basePath+"/lecture/findKpInfos?lectureId="+lectureId);
                    }
                }
                //加载笔记列表
                if(flag=="note"){
                    if(StringUtils.isEmpty($("#rightNotes").html().trim())){
                        $("#rightNotes").load(basePath+"/lecture/findMyNotes?lectureId="+lectureId+"&subjectId="+subjectId);
                    }
                }
                $(this).addClass('L_cur').siblings().removeClass('L_cur');
                $('#full_right_tab').nextAll('div.full_right_tab_panal:eq('+$(this).index()+')').show().siblings('div.full_right_tab_panal').hide();
            });
            //点击展示，收起相关答疑
            $('.drawal').click(function(){
                var $this = $(this),
                    $pars = $('.right_big'),
                    $left = $(".Nlist_left");
                listenView.conf.ulFlag = !listenView.conf.ulFlag;
                $pars.animate({width: 0},500,function(){
                    $pars.toggle();
                    $(".right_show").show();
                    $('.drawal').hide();
                });
                $left.animate({width:$left.parent().width()-20+'px'},500);
            });
            //点击展示，展示相关答疑
            $('.right_show').click(function(){
                var $this = $(this),
                    $pared = $('.right_big');
                listenView.conf.ulFlag = !listenView.conf.ulFlag;
                $pared.animate({width: '32%'},500,function(){
                    $pared.toggle();
                    $('.drawal').show();
                    $(".right_show").hide();
                    $(".Nlist_left").css('width','65%');
                });
            });

            //讲义字体大小设置
            $('.font_size_select').hover(
                function(){
                    $(this).find('.select_ul').toggle();
                    var $_c=$(this).children('i');
                    if($_c.hasClass('open')){
                        $_c.removeClass('open');
                    }else{
                        $_c.addClass('open');
                    }
                },
                function(){
                    var $_c=$(this).children('i');
                    if($_c.hasClass('open')){
                        $_c.removeClass('open');
                        $(this).find('.select_ul').hide();
                    }
                }
            );

            //展示 隐藏所有答案
            $('.show_all_answer').on('click',function(){
                if($(this).hasClass('show')){
                    $(this).removeClass('show').html('展示全<br/>部答案');
                    $('.que_answer').hide();
                }else{
                    $(this).addClass('show').html('隐藏全<br/>部答案');
                    $('.que_answer').show();
                }
            });
            /*选择框选中选项*/
            $('.select_ul li').on('click',function(){
                var _this=$(this);
                var index = _this.index();
                $('.select_ul').each(function(i,n){
                    $('li:eq('+index+')',n).addClass('cur').siblings().removeClass('cur').parent().hide().siblings('span').html(_this.text()).next('a').removeClass('open');
                });
                var fz = $('.section').css('font-size');
                if (!fz){
                    fz = 14;
                }else{
                    fz = parseInt(fz.substring(0, fz.length - 2));
                }
                $('#zoomBigBtn,#zoomNormalBtn,#zoomSmallBtn').removeAttr('style');
                if ($(this).attr('value') == 'big') {
                    fz=16;
                    $('#zoomBigBtn').css({'color':'#F38209','font-weight':'bold'});
                } else if ($(this).attr('value') == 'small') {
                    fz=12;
                    $('#zoomSmallBtn').css({'color':'#F38209','font-weight':'bold'});
                } else if ($(this).attr('value') == 'normal') {
                    fz = 14;
                    $('#zoomNormalBtn').css({'color':'#F38209','font-weight':'bold'});
                } else
                    return;
                $('.section').css('font-size', fz + 'px');
                $('.section span[class!=content]').css('font-size', fz + 'px');
                $('.section').css('line-height', (fz + 11) + 'px');
                return false;
            });
            //关窗绑定事件
            $('.box_head_close').on('click',function(){
                listenView.handler.closeBox();
            });
            //开关灯效果
            $('.day_or_night').on('click',function(){
                if($(this).attr('night') == 'true'){
                    $(this).removeClass('night').attr('night','false');
                    $('body').removeClass('dark');
                    $('.head_left img:first').attr('src',rp+rv+'/static/course/img/logo.png');
                }else{
                    $(this).addClass('night').attr('night','true');
                    $('body').addClass('dark');
                    $('.head_left img:first').attr('src',rp+rv+'/static/course/img/dark_logo.png');
                }
            });
            //禁止选择 取消禁止选择 2017.1.11
            /*$(document).on('selectstart','#lecture',function(){
             return false;
             });*/
            //绑定页面滚动小窗随着滚动事件
            $(window).on('scroll',function () {
                if(listenView.data.threeScreeLock){
                    return false;
                }
                var t = document.documentElement.scrollTop || document.body.scrollTop;
                if (t > 540 && listenView.conf.screen.moveflog == true) {
                    listenView.handler.drawPage('small');
                }else if(t < 540 && listenView.conf.screen.moveflog == true){
                    listenView.handler.drawPage('smalltobig');
                }
            });
            $(window).on('resize',function(){
                if(listenView.data.threeScreeLock){
                    //讲义设置
                    $('.Nlist_left').css({
                        width:function(){
                            var width = $('#bigScreen').width() - 505
                            if(508 < width){
                                return width;
                            }else{
                                return 508;
                            }
                        }
                    });
                }
                listenView.inits.initDate();
            });
            /* lecture init * */
            // 讲义 双击播放事件
            $('.section').on({
                //双击事件
                dblclick : function(){
                    var time = $(this).attr("time"),
                        ft = Math.round(parseTime2Second(time));
                    listenView.data.flag = ft;
                    listenView.handler.initHandout(['clickthree',ft+1]);
                    video.seekVideo(ft);
                },
                //鼠标离开
                mouseleave : function() {
                    if(!$(this).hasClass('playing')){
                        $(this).removeClass('select_listen');
                    }
                    $(" .chico",$(this)).hide();
                },
                //鼠标悬浮
                mouseenter : function(){
                    $(this).addClass('select_listen');
                    $(" .chico",$(this)).show();
                }
            });

            //点击视频列表，展示视频列表
            $('.video_list>span').click(function(){
                var courseId = $("#courseId").val();
                var lectureId = $("#lectureId").val();
                //获取课程目录
                if(StringUtils.isEmpty($("#courseCatalog").html().trim())){
                    $("#courseCatalog").load(basePath+'/lecture/findCourseCatalogs?courseId='+courseId+"&lectureId="+lectureId);
                }
                var w = listenView.conf.ulFlag1?26:270,
                    $this = $(this),
                    $par = $this.parent('.video_list');
                if (w == 270)$par.addClass('video_list_act');
                listenView.conf.ulFlag1 = !listenView.conf.ulFlag1;
                $par.animate({width: w},500,function(){
                    $this.hide()
                        .siblings('span').show()
                        .parent('.video_list')//.toggleClass('video_list_show')
                        .children('ul').toggle();
                    if (w == 26)$par.removeClass('video_list_act');
                });
            });
            /*点击章节展开列表 -- 一级*/
            $('.video_list>ul>li>p').click(function(){
                var $this = $(this);
                $this.next('ul').toggle();
                $this.parent('li').siblings('li').children('ul').hide();
            });
            /*点击章节展开列表 -- 二级*/
            $('.video_list>ul>li>ul>li>p').click(function(){
                var $this = $(this);
                $this.next('ul').toggle();
                $this.parent('li').siblings('li').children('ul').hide();
            });
            /*知识点*/
            $('.know_point').hover(function(){
                $(this).children('a').show();
            },function(){
                $(this).children('a').hide();
            });
            //多选题
            $('.sub_seclet_bg').on('click',function(){
                $(this).toggleClass('sub_seclet_bg1');
            });
            //点选题
            $('.sub_radio_bg').on('click',function(){
                if($(this).toggleClass('sub_radio_bg1').hasClass('sub_radio_bg1')){
                    $(this).parent().siblings('.multiselect_select').find('.sub_radio_bg1').removeClass('sub_radio_bg1');
                }
            });
            //答疑详情列表hover
            /* 答疑列表 */
            $('.answers_content>div').hover(function (e){
                $(this).addClass('color_orange');
            },function (e){
                $(this).removeClass('color_orange');
            });
            $('.answer_zhi').hover(function(e){
                $(this).parents('.color_orange').removeClass('color_orange').addClass('color_orange_cancle');
            },function(e){
                $(this).parents('.color_orange_cancle').removeClass('color_orange_cancle').addClass('color_orange')
            });
            /*$('.answers_content>div').hover(function (){
             $(this).addClass('color_orange');
             },function (){
             $(this).removeClass('color_orange');
             });*/

            //大视频左侧列表点击播放视频
            /*$('#video_list a:not([time])').on('click','a[course]',function(){
             var href = $(this).parent(':not([time])').attr('href');
             if(href){
             window.location.href = href;
             }
             var lectureId = $(this).parent().attr("lectureId");
             var startTime = $(this).parent().attr("startTime");
             var endTime = $(this).parent().attr("endTime");
             //post方式请求播放视频(大视频左侧的列表的知识点不是当前播放讲次的情况)

             subFromToListenLecture(document.body,lectureId,startTime,endTime,"m3u8");
             });*/
            //大视频左侧列表点击播放视频
            $('#video_list').on('click','li[lectureId]',function(){
                var lectureId = $(this).attr("lectureId");
                var startTime = "00:00:00";
                var endTime = null;
                //post方式请求播放视频(大视频左侧的列表的讲次不是当前播放讲次的情况)
                subFromToListenLecture(document.body,lectureId,startTime,endTime,"m3u8");
            });
            //视频列表点击
            $('#video_list').on('click','a[time]',function(){
                //$(this).addClass('activity').parent().siblings().children('a').removeClass('activity');
                var time = $(this).attr("time"),
                    ft = Math.round(parseTime2Second(time));
                listenView.data.flag = ft;
                listenView.handler.initHandout(['clickthree',ft+1]);
                video.seekVideo(ft);
            });
            /*//三分屏列表目录
             $('.listen_course_list li[time]').on('click',function(){
             var time = $(this).attr("time"),
             ft = Math.round(parseTime2Second(time));
             listenView.data.flag = ft;
             listenView.handler.initHandout(['clickthree',ft+1]);
             video.seekVideo(ft);
             });*/
        }, //修改笔记拖拽
        dragBox: function (box) {
            var title = box.children('div:first');
            var disX = 0, disY = 0;
            var posX = 0, posY = 0;
            var maxW, maxH;
            title.off('mousedown').on('mousedown', function (event) {
                var event = event || window.event;
                if (!$(event.target).hasClass('close')) {
                    disX = event.offsetX;
                    disY = event.offsetY;
                    maxW = $(window).width() - box.width();
                    maxH = $(window).height() - box.height();
                    $(document).on({
                        mousemove: function (event) {
                            var event = event || window.event;
                            posX = event.clientX - disX;
                            posY = event.clientY - disY;
                            posX = Math.max(posX, 0);
                            posY = Math.max(posY, 0);
                            posX = Math.min(posX, maxW);
                            posY = Math.min(posY, maxH);
                            box.css({
                                left: posX,
                                top: posY,
                                right: 'initial',
                                margin: "0"
                            });
                        },
                        mouseup: function () {
                            $(document).off('mousemove');
                            $(document).off('mouseup');
                        }
                    });
                }
            });
        }
    };
    //获取请求播放地址
    var requestURL = $("#requestURL").val();
    if(isPreview){
        initType = "big";
    }
    bindFirst();
    exports.listen = listenView;
    init();

});

/**
 * 将 时:分:秒 格式数据转换为秒
 */
function parseTime2Second(playTime){
    var timeArr = playTime.split(':');
    seconds = timeArr[0]*60*60+timeArr[1]*60+parseInt(timeArr[2]);
    return seconds;
}

/**
 * 将秒转换为hh：mm：ss格式
 */
function formatTime(leftTime) {
    var resultTime = "";
    if(leftTime < 0){
        leftTime = Math.abs(leftTime);
        resultTime = "-";
    }
    //小时数
    var hours = leftTime / 60 / 60;
    //对小时余
    var hoursRound = Math.floor(hours);
    //剩余分钟数
    var minutes = leftTime / 60  - (60 * hoursRound);
    //对分钟取余
    var minutesRound = Math.floor(minutes);
    //秒数
    var seconds = leftTime - (60 * 60 * hoursRound) - (60 * minutesRound);
    //个位数的小时显示为00:00:00小时的格式
    if(hoursRound < 10){
        hoursRound = "0" + hoursRound;
    }
    //个位数的分钟显示为00:00:00分钟的格式
    if(minutesRound < 10){
        minutesRound = "0" + minutesRound;
    }
    //个位数秒显示为00:00:00分钟的格式
    if(seconds < 10){
        seconds = "0" + seconds;
    }
    //拼接显示格式
    resultTime += hoursRound + ":" + minutesRound + ":" + seconds;
    return resultTime
}

/**
 * 重新听本讲
 */
function reListen(){
    //重新设置视频播放时间
    video.seekVideo(0);
    //调用视频播放方法
    video.playVideo();
}

/**
 * 缓存学员最后一次听课的播放格式
 */
function putCacheInitPlayType(initType){

}

$().ready(function () {
    if(isPreview){
        // 预览视频处理
        preparePreview();
    }
});

/**
 * 处理预览视频
 * */
function preparePreview() {
    var lectureId = $("#lectureId").val();
   /* // 加载三分屏目录
    $("#threeCatalogs").load(basePath+"/exp/preview3Catalog?lectureId="+lectureId);
    //设置听课相关属性内容
    setCourseRelateContent();
    // 隐藏提问按钮以及编写笔记
    $(".chico_question").hide();
    $(".chico_question").next().hide();
    // 隐藏收藏按钮
    $(".handout_collection_btn").hide();
    // 去掉缓存用户视频方式的功能
    putCacheInitPlayType = function (initType) {};
    // 隐藏flash中查看课程目录的按钮
    $('.video_list>span').hide();
    //隐藏评价按钮
    $('.lesson_evaluate_pop').hide();*/
}

function setCourseRelateContent(){
   /* var noContent = '<div class="panal_no_content"><img src="'+rp+rv+'/static/course/img/listen_panal_no_content.png"><p>未发现本讲的相关内容</p></div>';
    // 加载试卷
    $("#rightKpInfos").append(noContent);
    $("#threeKpInfos").append(noContent);
    // 加载答疑
    $("#rightQaList").append(noContent);
    $("#threeQaList").append(noContent);
    // 加载笔记
    $("#rightNotes").append(noContent);
    $("#threeKpNotes").append(noContent);*/
}